[
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 1,
        "Plot": "1403:- Henry IV finds himself facing uprisings from the Welsh chieftain Owen Glendower and impetuous young Harry Hotspur,son of the Duke of Northumberland,angry with the king for not paying...        ",
        "Rating": "N/A",
        "Title": "Henry IV, Part 1: \"The Hollow Crown\"",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Horror, Sci-Fi, Thriller",
        "MovieID": 2,
        "Plot": "Henrik, a much beloved priest, doesn't believe in hell. Upon receiving the news of his fathers death, he starts a journey that will take him through terrifying secrets, distorted childhood memories, and shake the foundation of his belief.",
        "Rating": "N/A",
        "Title": "Psalm 21",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime",
        "MovieID": 3,
        "Plot": "The Bride wakens from a four-year coma. The child she carried in her womb is gone. Now she must wreak vengeance on the team of assassins who betrayed her - a team she was once part of.                ",
        "Rating": "R",
        "Title": "Kill Bill: Vol. 1",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family",
        "MovieID": 4,
        "Plot": "A group of smart-talking toddlers find themselves at the center of a media mogul's experiment to crack the code to baby talk. The toddlers must race against time for the sake of babies everywhere.",
        "Rating": "PG",
        "Title": "Superbabies: Baby Geniuses 2",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Fantasy, Mystery",
        "MovieID": 5,
        "Plot": "Harry, Ron and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.",
        "Rating": "PG-13",
        "Title": "Harry Potter and the Deathly Hallows: Part 2",
        "Year": "2011"
    },
    {
        "Copies": "2",
        "Genre": "Action, Thriller",
        "MovieID": 6,
        "Plot": "F/X man Rollie Tyler (Bryan Brown) is now a toy maker. Mike Brandon (Tom Mason), the ex-husband of Rolly's girlfriend Kim(Rachel Ticotin), is a cop. He asks Rollie to help catch a killer. The operation goes well until some unknown man kills both the killer and Mike.Mike's boss, Ray Silak (Philip Bosco) says it was the killer who killed Mike but Rollie knows it wasn't. Silak is involved with Mike's death, so he calls on Leo McCarthy (Brian Dennehy), the cop from the last movie, who is now a P.I., for help and they discover it's not just Silak they have to worry about. ",
        "Rating": "PG-13",
        "Title": "FX/2",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy",
        "MovieID": 7,
        "Plot": "A harried movie director retreats into his memories and fantasies.",
        "Rating": "Not Rated",
        "Title": "8½",
        "Year": "1963"
    },
    {
        "Copies": "",
        "Genre": "Fantasy, Horror, Mystery",
        "MovieID": 8,
        "Plot": "A family vacationing in a small town discovers the entire town is inhabited by goblins in disguise as humans, who plan to eat them.",
        "Rating": "PG-13",
        "Title": "Troll 2",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 9,
        "Plot": "Monsters generate their city's power by scaring children, but they are terribly afraid themselves of being contaminated by children, so when one enters Monstropolis, top scarer Sulley finds his world disrupted.",
        "Rating": "G",
        "Title": "Monsters, Inc.",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 10,
        "Plot": "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond.",
        "Rating": "R",
        "Title": "Snatch.",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 11,
        "Plot": "The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.",
        "Rating": "G",
        "Title": "Toy Story 3",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 12,
        "Plot": "A bitter aging couple with the help of alcohol, use a young couple to fuel anguish and emotional pain towards each other.",
        "Rating": "Not Rated",
        "Title": "Who's Afraid of Virginia Woolf?",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Horror, Music, Musical",
        "MovieID": 13,
        "Plot": "Jerry falls in love with a stripper he meets at a carnival. Little does he know that she is the sister of a gypsy fortune teller whose predictions he had scoffed at earlier. The gypsy turns him into a zombie and he goes on a killing spree.",
        "Rating": "Not Rated",
        "Title": "The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy",
        "MovieID": 14,
        "Plot": "A harried movie director retreats into his memories and fantasies.",
        "Rating": "Not Rated",
        "Title": "8½",
        "Year": "1963"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Sport",
        "MovieID": 15,
        "Plot": "When a rap mogul from Atlanta tries to join a conservative country club in the Carolinas he runs into fierce opposition from the board President- but it's nothing that he and his entourage can't handle.",
        "Rating": "PG-13",
        "Title": "Who's Your Caddy?",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, Mystery",
        "MovieID": 16,
        "Plot": "Jack Bauer, Director of Field Ops for the Counter-Terrorist Unit of Los Angeles, races against the clock to subvert terrorist plots and save his nation from ultimate disaster.",
        "Rating": "TV-14",
        "Title": "24",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 17,
        "Plot": "A bigoted Frenchman finds himself forced to impersonate a popular rabbi while on the run from a group of assassins - and the police.",
        "Rating": "G",
        "Title": "The Mad Adventures of 'Rabbi' Jacob",
        "Year": "1973"
    },
    {
        "Copies": "",
        "Genre": "Animation, Family",
        "MovieID": 18,
        "Plot": "A Cinderella meets her Prince Charming on the ill-fated Titanic. Along for the ride are a rapping dog, other talking animals, and an assortment of wacky humans.",
        "Rating": "N/A",
        "Title": "Titanic: The Legend Goes On...",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 19,
        "Plot": "Brash NYC policeman Officer Gunther Toody is partnered with stiff, by-the-book Officer Francis Muldoon to protect an important mafia witness prior to testifying against orgainzed crime in ...",
        "Rating": "PG-13",
        "Title": "Car 54, Where Are You?",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy",
        "MovieID": 20,
        "Plot": "A secret agent is called out of retirement to save the world from an evil genius.",
        "Rating": "PG",
        "Title": "Leonard Part 6",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, War",
        "MovieID": 21,
        "Plot": "When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer.",
        "Rating": "Not Rated",
        "Title": "Stalag 17",
        "Year": "1953"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 22,
        "Plot": "In the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them.",
        "Rating": "PG-13",
        "Title": "O Brother, Where Art Thou?",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi, Thriller",
        "MovieID": 23,
        "Plot": "An extraterrestrial race forced to live in slum-like conditions on Earth suddenly finds a kindred spirit in a government agent who is exposed to their biotechnology.",
        "Rating": "R",
        "Title": "District 9",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 24,
        "Plot": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.",
        "Rating": "R",
        "Title": "Once Upon a Time in America",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 25,
        "Plot": "A bitter aging couple with the help of alcohol, use a young couple to fuel anguish and emotional pain towards each other.",
        "Rating": "Not Rated",
        "Title": "Who's Afraid of Virginia Woolf?",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 26,
        "Plot": "In late-19th-century Russian high society, St. Petersburg aristocrat Anna Karenina enters into a life-changing affair with the dashing Count Alexei Vronsky.",
        "Rating": "R",
        "Title": "Anna Karenina",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 27,
        "Plot": "The true story of Paul Rusesabagina, a hotel manager who housed over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda.",
        "Rating": "PG-13",
        "Title": "Hotel Rwanda",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Biography, Drama",
        "MovieID": 28,
        "Plot": "A flamboyant and controversial British military figure and his conflicted loyalties during his World War I service in the Middle East.",
        "Rating": "PG",
        "Title": "Lawrence of Arabia",
        "Year": "1962"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 29,
        "Plot": "A self-conscious bride is tormented by the memory of her husband's dead first wife.",
        "Rating": "Not Rated",
        "Title": "Rebecca",
        "Year": "1940"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 30,
        "Plot": "An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley.",
        "Rating": "R",
        "Title": "Magnolia",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 31,
        "Plot": "A care-free girl is sold to a traveling entertainer, consequently enduring physical and emotional pain along the way.",
        "Rating": "Not Rated",
        "Title": "La Strada",
        "Year": "1954"
    },
    {
        "Copies": "2",
        "Genre": "Action, Adventure, Comedy ",
        "MovieID": 32,
        "Plot": "Dr. Evil is back...and has invented a new time machine that allows him to go back to the 60's and steal Austin Powers's mojo, inadvertently leaving him \"shagless\". ",
        "Rating": "PG-13",
        "Title": "Austin Powers: The Spy Who Shagged Me",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 33,
        "Plot": "A nurse is put in charge of an actress who can't talk and finds that the actress's persona is melding with hers.",
        "Rating": "Not Rated",
        "Title": "Persona",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 34,
        "Plot": "Adam, a lonely man with Asperger's Syndrome, develops a relationship with his upstairs neighbor, Beth.",
        "Rating": "PG-13",
        "Title": "Adam",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 35,
        "Plot": "Roro, a foreign worker in Swedish parks, loves his girlfriend but is about to marry another girl to prevent her from being sent back to Lebanon. Roros best friend, Måns, has his own ...",
        "Rating": "N/A",
        "Title": "Jalla! Jalla!",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Horror",
        "MovieID": 36,
        "Plot": "A modern-day updating of the Dracula legend that finds Steven, a good-looking American hero devastated by the death of his girlfriend, wandering through Europe and looking for happiness. A ...",
        "Rating": "N/A",
        "Title": "Die Hard Dracula",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, War",
        "MovieID": 37,
        "Plot": "Set in unoccupied Africa during the early days of World War II: An American expatriate meets a former lover, with unforeseen complications.",
        "Rating": "PG",
        "Title": "Casablanca",
        "Year": "1942"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi, Thriller",
        "MovieID": 38,
        "Plot": "In a future British tyranny, a shadowy freedom fighter plots to overthrow it with the help of a young woman.",
        "Rating": "R",
        "Title": "V for Vendetta",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 39,
        "Plot": "In London, four very different people team up to commit armed robbery, then try to doublecross each other for the loot.",
        "Rating": "R",
        "Title": "A Fish Called Wanda",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Animation, Action, Adventure",
        "MovieID": 40,
        "Plot": "In the Valley of Peace, Po the Panda finds himself chosen as the Dragon Warrior despite the fact that he is obese and a complete novice at martial arts.",
        "Rating": "PG",
        "Title": "Kung Fu Panda",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Comedy, War",
        "MovieID": 41,
        "Plot": "An insane general triggers a path to nuclear holocaust that a war room full of politicians and generals frantically try to stop.",
        "Rating": "PG",
        "Title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 42,
        "Plot": "Survivors of a plane crash on a remote island find it is covered by spiders. When bitten, the survivors start turning into spiders!",
        "Rating": "Unrated",
        "Title": "Body in the Web",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 43,
        "Plot": "An insomniac office worker looking for a way to change his life crosses paths with a devil-may-care soap maker and they form an underground fight club that evolves into something much, much more...",
        "Rating": "R",
        "Title": "Fight Club",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 44,
        "Plot": "Five high school students, all different stereotypes, meet in detention, where they pour their hearts out to each other, and discover how they have a lot more in common than they thought.",
        "Rating": "R",
        "Title": "The Breakfast Club",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 45,
        "Plot": "After being betrayed and left for dead in Italy, Charlie Croker and his team plan an elaborate gold heist against their former ally.",
        "Rating": "PG-13",
        "Title": "The Italian Job",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 46,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "Alan Davies: Live at the Lyric",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Biography, Comedy, Drama",
        "MovieID": 47,
        "Plot": "Embarrassed by his large nose, a romantic poet/soldier romances his cousin by proxy.",
        "Rating": "PG",
        "Title": "Cyrano de Bergerac",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Music",
        "MovieID": 48,
        "Plot": "Five friends spend one lost weekend in a mix of music, love and club culture.",
        "Rating": "R",
        "Title": "Human Traffic",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 49,
        "Plot": "A struggling young comedian takes a menial job on a cruise ship where he hopes for his big chance to make it in the world of cruise ship comedy.",
        "Rating": "R",
        "Title": "Going Overboard",
        "Year": "1989"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Family",
        "MovieID": 50,
        "Plot": "The Tramp cares for an abandoned child, but events put that relationship in jeopardy.",
        "Rating": "Not Rated",
        "Title": "The Kid",
        "Year": "1921"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Fantasy",
        "MovieID": 51,
        "Plot": "A classic Disney fairytale collides with modern-day New York City in a story about a fairytale princess who is sent to our world by an evil queen. Soon after her arrival, Princess Giselle begins to change her views on life and love after meeting a handsome lawyer. Can a storybook view of romance survive in the real world?",
        "Rating": "PG",
        "Title": "Enchanted",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, War",
        "MovieID": 52,
        "Plot": "A manipulative Southern belle carries on a turbulent affair with a blockade runner during the American Civil War.",
        "Rating": "TV-PG",
        "Title": "Gone with the Wind",
        "Year": "1939"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, Sci-Fi",
        "MovieID": 53,
        "Plot": "A couple undergo a procedure to erase each other from their memories when their relationship turns sour, but it is only through the process of loss that they discover what they had to begin with.",
        "Rating": "R",
        "Title": "Eternal Sunshine of the Spotless Mind",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Drama, Film-Noir",
        "MovieID": 54,
        "Plot": "A hack screenwriter writes a screenplay for a former silent-film star who has faded into Hollywood obscurity.",
        "Rating": "Not Rated",
        "Title": "Sunset Blvd.",
        "Year": "1950"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 55,
        "Plot": "An undercover state cop who has infiltrated an Irish gang and a mole in the police force working for the same mob race to track down and identify each other before being exposed to the enemy, after both sides realize their outfit has a rat.",
        "Rating": "R",
        "Title": "The Departed",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 56,
        "Plot": "A surfer becomes the head of a major company.",
        "Rating": "PG-13",
        "Title": "Chairman of the Board",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Biography, Drama",
        "MovieID": 57,
        "Plot": "After graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters that shape his life.",
        "Rating": "R",
        "Title": "Into the Wild",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama",
        "MovieID": 58,
        "Plot": "After a brilliant but asocial mathematician accepts secret work in cryptography, his life takes a turn for the nightmarish.",
        "Rating": "PG-13",
        "Title": "A Beautiful Mind",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 59,
        "Plot": "Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer.",
        "Rating": "R",
        "Title": "City of God",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Action, Thriller",
        "MovieID": 60,
        "Plot": "John McClane, officer of the NYPD, tries to save wife Holly Gennaro and several others, taken hostage by German terrorist Hans Gruber during a Christmas party at the Nakatomi Plaza in Los Angeles.",
        "Rating": "R",
        "Title": "Die Hard",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Fantasy",
        "MovieID": 61,
        "Plot": "When God appears to an assistant grocery manager as a good natured old man, the Almighty selects him as his messenger for the modern world.",
        "Rating": "PG",
        "Title": "Oh, God!",
        "Year": "1977"
    },
    {
        "Copies": "",
        "Genre": "Action, Horror, Thriller",
        "MovieID": 62,
        "Plot": "A group of teens arrive on an island for a rave--only to discover the island has been taken over by zombies. The group takes refuge in a house where they try to survive the night.",
        "Rating": "R",
        "Title": "House of the Dead",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama, Horror, Mystery",
        "MovieID": 63,
        "Plot": "A paranormal expert discovers a house that is at the intersection of so-called \"highways\" transporting souls in the afterlife.",
        "Rating": "R",
        "Title": "Book of Blood",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 64,
        "Plot": "In 1954, U.S. Marshal Teddy Daniels is investigating the disappearance of a murderess who escaped from a hospital for the criminally insane and is presumed to be hiding nearby.",
        "Rating": "R",
        "Title": "Shutter Island",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Sport",
        "MovieID": 65,
        "Plot": "A trained chimpanzee plays third base for a minor-league baseball team.",
        "Rating": "PG",
        "Title": "Ed",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 66,
        "Plot": "The continuing story of life in the Midwestern town of Bay City, and the love, loss, trials, and triumph of its residents, who come from different backgrounds and social circles. Those who ...",
        "Rating": "TV-14",
        "Title": "Another World",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Biography, Crime",
        "MovieID": 67,
        "Plot": "Two Western bank/train robbers flee to Bolivia when the law gets too close.",
        "Rating": "N/A",
        "Title": "Butch Cassidy and the Sundance Kid",
        "Year": "1969"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 68,
        "Plot": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.",
        "Rating": "R",
        "Title": "There Will Be Blood",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Sci-Fi",
        "MovieID": 69,
        "Plot": "After an encounter with UFOs, a line worker feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
        "Rating": "PG",
        "Title": "Close Encounters of the Third Kind",
        "Year": "1977"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Family",
        "MovieID": 70,
        "Plot": "Kidz in da Hood is the gripping and warm story of Amina, who came to Sweden with her grandfather three years ago. Amina has not yet received her residency permit and when her grandfather ...",
        "Rating": "N/A",
        "Title": "Kidz in da Hood",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": null,
        "MovieID": 71,
        "Plot": null,
        "Rating": "PG",
        "Title": "Nausicaä of the Valley of the Wind",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Western",
        "MovieID": 72,
        "Plot": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
        "Rating": "R",
        "Title": "Django Unchained",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Horror, Thriller",
        "MovieID": 73,
        "Plot": "Teens trapped on an island are haunted by a demon hidden inside...a pinata.",
        "Rating": "R",
        "Title": "Demon Island",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 74,
        "Plot": "Atticus Finch, a lawyer in the Depression-era South, defends a black man against an undeserved rape charge, and his kids against prejudice.",
        "Rating": "Not Rated",
        "Title": "To Kill a Mockingbird",
        "Year": "1962"
    },
    {
        "Copies": "",
        "Genre": "Action, Thriller",
        "MovieID": 75,
        "Plot": "A young cop must prevent a bomb exploding aboard a city bus by keeping its speed above 50 mph.",
        "Rating": "R",
        "Title": "Speed",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Family",
        "MovieID": 76,
        "Plot": "Mom and dad dump son Cody, daughter Abby, her best friend Marcella and a baby on the farm with Grandpa and Grandma. Purple dinosaur Barney soon appears to entertain kids, and when a large ...",
        "Rating": "G",
        "Title": "Barney's Great Adventure",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy, Sci-Fi",
        "MovieID": 78,
        "Plot": "It is intended to be a comedy film with serious special effects, though it becomes an epic film of laughs as the suppressor of the first series of the film 'The man who saves Earth'...See full synopsis&nbsp;&raquo;",
        "Rating": "N/A",
        "Title": "Turks in Space",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama",
        "MovieID": 79,
        "Plot": "Toby is a teenager who doesn't care much about school. In fact, he has his eyes on the title of a prestigious dog-sleigh race. He will have to undergo extensive training in order to win it.",
        "Rating": "PG",
        "Title": "Toby McTeague",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Fantasy",
        "MovieID": 80,
        "Plot": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.",
        "Rating": "R",
        "Title": "The Green Mile",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 81,
        "Plot": "Two comedians set out to make their own exploitation video.",
        "Rating": "N/A",
        "Title": "Danes Without a Clue",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 82,
        "Plot": "An ingenue insinuates herself in to the company of an established but aging stage actress and her circle of theater friends.",
        "Rating": "TV-PG",
        "Title": "All About Eve",
        "Year": "1950"
    },
    {
        "Copies": "",
        "Genre": "Drama, Family, History",
        "MovieID": 83,
        "Plot": "Miracle tells the true story of Herb Brooks (Russell), the player-turned-coach who led the 1980 U.S. Olympic hockey team to victory over the seemingly invincible Russian squad.",
        "Rating": "PG",
        "Title": "Miracle",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 84,
        "Plot": "A senator, who became famous for killing a notorious outlaw, returns for the funeral of an old friend and tells the truth about his deed.",
        "Rating": "Approved",
        "Title": "The Man Who Shot Liberty Valance",
        "Year": "1962"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 85,
        "Plot": "When a sports agent has a moral epiphany and is fired for expressing it, he decides to put his new philosophy to the test as an independent with the only athlete who stays with him.",
        "Rating": "R",
        "Title": "Jerry Maguire",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 86,
        "Plot": "A greedy landowner and his backward nephew conspire to block the only water source for an adjoining property in order to bankrupt the owner and force him to sell.",
        "Rating": "PG",
        "Title": "Jean de Florette",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": null,
        "MovieID": 87,
        "Plot": null,
        "Rating": "R",
        "Title": "Amélie",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Horror, Thriller",
        "MovieID": 88,
        "Plot": "Tom returns to his hometown on the tenth anniversary of the Valentine's night massacre that claimed the lives of 22 people. Instead of a homecoming, however, Tom finds himself suspected of committing the murders, and it seems like his old flame is the only one will believes he's innocent.",
        "Rating": "R",
        "Title": "My Bloody Valentine",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery",
        "MovieID": 89,
        "Plot": "Following the death of a publishing tycoon, news reporters scramble to discover the meaning of his final utterance.",
        "Rating": "Approved",
        "Title": "Citizen Kane",
        "Year": "1941"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Family, Fantasy",
        "MovieID": 90,
        "Plot": "Harry finds himself mysteriously selected as an under-aged competitor in a dangerous tournament between three schools of magic.",
        "Rating": "PG-13",
        "Title": "Harry Potter and the Goblet of Fire",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 91,
        "Plot": "After local youth Abdel is beaten unconscious by police, a riot ensues on his estate during which a policeman loses his gun. The gun is found by Vinz who threatens he will kill a cop if Abdel dies.",
        "Rating": "Not Rated",
        "Title": "La Haine",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Fantasy, Horror",
        "MovieID": 92,
        "Plot": "Fleeing from the cult that murdered his father, a teen is aided in his quest to find the lost city of the fabled Ziox by a secretive drifter.",
        "Rating": "PG-13",
        "Title": "The Final Sacrifice",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": null,
        "MovieID": 93,
        "Plot": null,
        "Rating": "G",
        "Title": "WALL·E",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Animation, Comedy, Family",
        "MovieID": 94,
        "Plot": "A rat, who can also cook, makes an unusual alliance with a young kitchen worker at a famous restaurant.",
        "Rating": "G",
        "Title": "Ratatouille",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 95,
        "Plot": "A young Shakespeare, out of ideas and short of cash, meets his ideal woman and is inspired to write one of his most famous plays.",
        "Rating": "R",
        "Title": "Shakespeare in Love",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 96,
        "Plot": "Armed with a license to kill, Secret Agent James Bond sets out on his first mission as 007 and must defeat a weapons dealer in a high stakes game of poker at Casino Royale, but things are not what they seem.",
        "Rating": "PG-13",
        "Title": "Casino Royale",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy, Mystery",
        "MovieID": 97,
        "Plot": "In a society where humans and vampires co-exist, set in the small town of Bon Temps, Louisiana, Sookie Stackhouse is a young woman who may have found a perfect boyfriend. Sookie is ...",
        "Rating": "TV-MA",
        "Title": "Strange Love",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Sci-Fi",
        "MovieID": 98,
        "Plot": "In the midst of the Gulf War, soldiers are kidnapped and brainwashed for sinister purposes.",
        "Rating": "R",
        "Title": "The Manchurian Candidate",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 99,
        "Plot": "Disturbed Blanche DuBois moves in with her sister in New Orleans and is tormented by her brutish brother-in-law while her reality crumbles around her.",
        "Rating": "PG",
        "Title": "A Streetcar Named Desire",
        "Year": "1951"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 100,
        "Plot": "Two bounty hunters with the same intentions, team up to track down a Western outlaw.",
        "Rating": "Approved",
        "Title": "For a Few Dollars More",
        "Year": "1965"
    },
    {
        "Copies": "",
        "Genre": "Drama, Music",
        "MovieID": 101,
        "Plot": "A young man from the South Bronx dreams of making it as a rapper, until a run-in with local thugs forces him to hide in Puerto Rico with the father he never knew.",
        "Rating": "PG-13",
        "Title": "Feel the Noise",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 102,
        "Plot": "Tony Washington is killed by a gang of rampant trendy teenagers. Molly Mokembe is a voodoo lady who brings him back from the dead to seek revenge on his killers so he can rest in peace.",
        "Rating": "R",
        "Title": "Zombie Nightmare",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy",
        "MovieID": 103,
        "Plot": "A comedic satire of films that are large in scope, reputation and popularity",
        "Rating": "PG-13",
        "Title": "Epic Movie",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy, Mystery",
        "MovieID": 104,
        "Plot": "With Jason in jail for Amy's murder, he tries to prove his innocence, while Sookie thinks that the killer is someone that they are close with. Meanwhile, Maryann bails Tara out of jail and ...",
        "Rating": "TV-MA",
        "Title": "You'll Be the Death of Me",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 105,
        "Plot": "In 1980 Miami, a determined Cuban immigrant takes over a drug cartel while succumbing to greed.",
        "Rating": "R",
        "Title": "Scarface",
        "Year": "1983"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 106,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "Keloglan vs. the Black Prince",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 107,
        "Plot": "A family gets lost on the road and stumbles upon a hidden, underground, devil-worshiping cult led by the fearsome Master and his servant Torgo.",
        "Rating": "Not Rated",
        "Title": "Manos: The Hands of Fate",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 108,
        "Plot": "Comedic tale of company workers who hate their jobs and decide to rebel against their greedy boss.",
        "Rating": "R",
        "Title": "Office Space",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Sci-Fi",
        "MovieID": 109,
        "Plot": "A teenager is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his friend, Dr. Emmett Brown, and must make sure his high-school-age parents unite in order to save his own existence.",
        "Rating": "PG",
        "Title": "Back to the Future",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Fantasy",
        "MovieID": 110,
        "Plot": "A couple of recently deceased ghosts contract the services of a \"bio-exorcist\" in order to remove the obnoxious new owners of their house.",
        "Rating": "PG",
        "Title": "Beetlejuice",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 111,
        "Plot": "Terrence Malick's adaptation of James Jones' autobiographical 1962 novel, focusing on the conflict at Guadalcanal during the second World War.",
        "Rating": "R",
        "Title": "The Thin Red Line",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, War",
        "MovieID": 112,
        "Plot": "The poet Missak Manouchian leads a mixed bag of youngsters and immigrants in a clandestine battle against the Nazi occupation. Twenty-two men and one woman fighting for an ideal and for ...",
        "Rating": "N/A",
        "Title": "Army of Crime",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, History",
        "MovieID": 113,
        "Plot": "Allied P.O.W.s plan for several hundred of their number to escape from a German camp during World War II.",
        "Rating": "Unrated",
        "Title": "The Great Escape",
        "Year": "1963"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 114,
        "Plot": "The rivalry between two magicians becomes more exacerbated by their attempt to perform the ultimate illusion.",
        "Rating": "PG-13",
        "Title": "The Prestige",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, Thriller",
        "MovieID": 115,
        "Plot": "A Mumbai teen who grew up in the slums, becomes a contestant on the Indian version of \"Who Wants To Be A Millionaire?\" He is arrested under suspicion of cheating, and while being interrogated, events from his life history are shown which explain why he knows the answers.",
        "Rating": "R",
        "Title": "Slumdog Millionaire",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 116,
        "Plot": "A murder inside the Louvre and clues in Da Vinci paintings lead to the discovery of a religious mystery protected by a secret society for two thousand years -- which could shake the foundations of Christianity.",
        "Rating": "PG-13",
        "Title": "The Da Vinci Code",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Family",
        "MovieID": 117,
        "Plot": "When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking home.",
        "Rating": "PG",
        "Title": "Howl's Moving Castle",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 118,
        "Plot": "A father's psychic abilities are put to the test when his two daughters are trapped inside of a corn maze haunted by the spirits of two young girls who disappeared a year earlier.",
        "Rating": "R",
        "Title": "The Maize: The Movie",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 119,
        "Plot": "Set during the Ice Age, a sabertooth tiger, a sloth, and a wooly mammoth find a lost human infant, and they try to return him to his tribe.",
        "Rating": "PG",
        "Title": "Ice Age",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 120,
        "Plot": "A boy who communicates with spirits that don't know they're dead seeks the help of a disheartened child psychologist.",
        "Rating": "PG-13",
        "Title": "The Sixth Sense",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 121,
        "Plot": "Recent college graduate Benjamin Braddock is trapped into an affair with Mrs. Robinson, who happens to be the wife of his father's business partner and then finds himself falling in love with her daughter, Elaine.",
        "Rating": "Approved",
        "Title": "The Graduate",
        "Year": "1967"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Family",
        "MovieID": 122,
        "Plot": "A classic fairy tale, with swordplay, giants, an evil prince, a beautiful princess, and yes, some kissing (as read by a kindly grandfather).",
        "Rating": "PG",
        "Title": "The Princess Bride",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi",
        "MovieID": 123,
        "Plot": "When an alien force tries to invade Earth to steal a powerful new rocket fuel, a mysterious hero intervenes.",
        "Rating": "N/A",
        "Title": "Prince of Space",
        "Year": "1959"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Thriller",
        "MovieID": 124,
        "Plot": "An American agent, under false suspicion of disloyalty, must discover and expose the real spy without the help of his organization.",
        "Rating": "PG-13",
        "Title": "Mission: Impossible",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Drama, Family, Fantasy",
        "MovieID": 125,
        "Plot": "An angel helps a compassionate but despairingly frustrated businessman by showing what life would have been like if he never existed.",
        "Rating": "Approved",
        "Title": "It's a Wonderful Life",
        "Year": "1946"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 126,
        "Plot": "Fred Dobbs and Bob Curtin, two Americans searching for work in Mexico, convince an old prospector to help them mine for gold in the Sierra Madre Mountains.",
        "Rating": "TV-PG",
        "Title": "The Treasure of the Sierra Madre",
        "Year": "1948"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi",
        "MovieID": 127,
        "Plot": "A young boy in the woods discovers a lovable alien...or is it?",
        "Rating": "N/A",
        "Title": "The Pod People",
        "Year": "1983"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 128,
        "Plot": "Two young men strangle their \"inferior\" classmate, hide his body in their apartment, and invite his friends and family to a dinner party as a means to challenge the \"perfection\" of their crime.",
        "Rating": "PG",
        "Title": "Rope",
        "Year": "1948"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 129,
        "Plot": "Chance, a simple gardener, has never left the estate until his employer dies. His simple TV-informed utterances are mistaken for profundity.",
        "Rating": "PG",
        "Title": "Being There",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Romance",
        "MovieID": 130,
        "Plot": "Young, wild poet Arthur Rimbaud and his mentor Paul Verlaine engage in a fierce, forbidden romance while feeling the effects of a hellish artistic lifestyle.",
        "Rating": "R",
        "Title": "Total Eclipse",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 131,
        "Plot": "Over the course of one evening, an unsuspecting group of twenty-somethings find themselves bombarded by a series of natural disasters and catastrophic events.",
        "Rating": "PG-13",
        "Title": "Disaster Movie",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Romance",
        "MovieID": 132,
        "Plot": "Two young people stand on a street corner in a run-down part of New York, kissing. Despite the lawlessness of the district they are left unmolested. A short distance away walk Maria and ...",
        "Rating": "N/A",
        "Title": "A Story About Love",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 133,
        "Plot": "In this lighthearted romance from Victorian novelist Thomas Hardy, the beautiful new village school teacher is pursued by three suitors: a working-class man, a landowner, and the vicar.",
        "Rating": "N/A",
        "Title": "Under the Greenwood Tree",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Music",
        "MovieID": 134,
        "Plot": "A biography of Hildegard Knef, one of Germany's biggest post-war stars.",
        "Rating": "N/A",
        "Title": "Hilde",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Sci-Fi",
        "MovieID": 135,
        "Plot": "In future Britain, charismatic delinquent Alex DeLarge is jailed and volunteers for an experimental aversion therapy developed by the government in an effort to solve society's crime problem - but not all goes according to plan.",
        "Rating": "X",
        "Title": "A Clockwork Orange",
        "Year": "1971"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 136,
        "Plot": "A mild-mannered man becomes a local hero through an act of violence, which sets off repercussions that will shake his family to its very core.",
        "Rating": "R",
        "Title": "A History of Violence",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 137,
        "Plot": "James Bond teams up with the lone survivor of a destroyed Russian research center to stop the hijacking of a nuclear space weapon by a fellow agent believed to be dead.",
        "Rating": "PG-13",
        "Title": "GoldenEye",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Action, Thriller",
        "MovieID": 138,
        "Plot": "Gritty neo-noir art film about escaped convict Griffin and his friends, who ran all the way to hell... with a penny, and a broken cigarette.",
        "Rating": "N/A",
        "Title": "Night Train to Mundo Fine",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Fantasy",
        "MovieID": 139,
        "Plot": "On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime.",
        "Rating": "PG-13",
        "Title": "Princess Mononoke",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 140,
        "Plot": "A mysterious Hollywood stuntman, mechanic and getaway driver lands himself in trouble when he helps out his neighbor.",
        "Rating": "R",
        "Title": "Drive",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Music, Romance",
        "MovieID": 141,
        "Plot": "A rap-oriented remake of \"The Wild One\", with heavy emphasis on the fact that rap star Vanilla Ice has assumed the Marlon Brando role.",
        "Rating": "PG",
        "Title": "Cool as Ice",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure",
        "MovieID": 142,
        "Plot": "When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis.",
        "Rating": "PG-13",
        "Title": "Indiana Jones and the Last Crusade",
        "Year": "1989"
    },
    {
        "Copies": "",
        "Genre": "Documentary, Biography, Music",
        "MovieID": 143,
        "Plot": "A documentary on the life, music, and legacy of Bob Marley.",
        "Rating": "PG-13",
        "Title": "Marley",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi, Thriller",
        "MovieID": 144,
        "Plot": "Jobe is resuscitated by Jonathan Walker. He wants Jobe to create a special computer chip that would connect all the computers in the world into one network, which Walker would control and ...",
        "Rating": "PG-13",
        "Title": "Lawnmower Man 2: Beyond Cyberspace",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama",
        "MovieID": 145,
        "Plot": "After the death of a friend, a writer recounts a boyhood journey to find the body of a missing boy.",
        "Rating": "R",
        "Title": "Stand by Me",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 146,
        "Plot": "A man refuses to conform to life in a rural prison.",
        "Rating": "PG",
        "Title": "Cool Hand Luke",
        "Year": "1967"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family",
        "MovieID": 147,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "The Hottie",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 148,
        "Plot": "Wealthy San Francisco financier Nicholas Van Orton gets a strange birthday present from wayward brother Conrad: a live-action game that consumes his life.",
        "Rating": "R",
        "Title": "The Game",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Crime",
        "MovieID": 149,
        "Plot": "James Bond investigates the hijacking of British and Russian submarines carrying nuclear warheads with the help of a KGB agent whose lover he killed.",
        "Rating": "PG",
        "Title": "The Spy Who Loved Me",
        "Year": "1977"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 150,
        "Plot": "A man and a woman move in to neighboring Hong Kong apartments and form a bond when they both suspect their spouses of extramarital activities.",
        "Rating": "PG",
        "Title": "In the Mood for Love",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 151,
        "Plot": "A soldier from Earth crash-lands on an alien world after sustaining battle damage. Eventually he encounters another survivor, but from the enemy species he was fighting; they band together ...",
        "Rating": "PG-13",
        "Title": "Enemy Mine",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 152,
        "Plot": "A young fugitive prince and princess must stop a villain who unknowingly threatens to destroy the world with a special dagger that enables the magic sand inside to reverse time.",
        "Rating": "PG-13",
        "Title": "Prince of Persia: The Sands of Time",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 153,
        "Plot": "A high school wise guy is determined to have a day off from school, despite of what the principal thinks of that.",
        "Rating": "PG-13",
        "Title": "Ferris Bueller's Day Off",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, History",
        "MovieID": 154,
        "Plot": "The story of the original Mercury 7 astronauts and their macho, seat-of-the-pants approach to the space program.",
        "Rating": "R",
        "Title": "The Right Stuff",
        "Year": "1983"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 155,
        "Plot": "Rex and Saskia, a young couple in love, are on vacation. They stop at a busy service station and Saskia is abducted. After three years and no sign of Saskia, Rex begins receiving letters from the abductor.",
        "Rating": "Unrated",
        "Title": "The Vanishing",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 156,
        "Plot": "A promising college athlete takes a turn for the worse when he hooks up with old highschool friends during his summer break.",
        "Rating": "R",
        "Title": "The Hillz",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Drama",
        "MovieID": 157,
        "Plot": "Lion cub and future king Simba searches for his identity. His eagerness to please others and penchant for testing his boundaries sometimes gets him into trouble.",
        "Rating": "G",
        "Title": "The Lion King",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Crime, Film-Noir, Thriller",
        "MovieID": 158,
        "Plot": "Crooks plan and execute a daring race-track robbery.",
        "Rating": "Approved",
        "Title": "The Killing",
        "Year": "1956"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 159,
        "Plot": "Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.",
        "Rating": "R",
        "Title": "Trainspotting",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 160,
        "Plot": "Will Hunting, a janitor at MIT, has a gift for mathematics but needs help from a psychologist to find direction in his life.",
        "Rating": "R",
        "Title": "Good Will Hunting",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 161,
        "Plot": "On an isolated lake, an old monk lives on a small floating temple. The wise master has also a young boy with him who learns to become a monk. And we watch as seasons and years pass by.",
        "Rating": "R",
        "Title": "Spring, Summer, Fall, Winter... and Spring",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime, Drama",
        "MovieID": 162,
        "Plot": "In 1930s Chicago, a young con man seeking revenge for his murdered partner teams up with a master of the big con to win a fortune from a criminal banker.",
        "Rating": "PG",
        "Title": "The Sting",
        "Year": "1973"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 163,
        "Plot": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "Rating": "PG-13",
        "Title": "The Lord of the Rings: The Return of the King",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Horror, Mystery, Sci-Fi",
        "MovieID": 164,
        "Plot": "Scientists in the Antarctic are confronted by a shape-shifting alien that assumes the appearance of the people that it kills.",
        "Rating": "R",
        "Title": "The Thing",
        "Year": "1982"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 165,
        "Plot": "Brooks Wilson is in crisis. He is torn between his wife Selma and two daughters and his mistress Grace, and also between his career as a successful illustrator and his feeling that he might...",
        "Rating": "R",
        "Title": "Loving",
        "Year": "1970"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 166,
        "Plot": "A family heads to an isolated hotel for the winter where an evil and spiritual presence influences the father into violence, while his psychic son sees horrific forebodings from the past and of the future.",
        "Rating": "R",
        "Title": "The Shining",
        "Year": "1980"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 167,
        "Plot": "A meek hobbit of The Shire and eight companions set out on a journey to Mount Doom to destroy the One Ring and the dark lord Sauron.",
        "Rating": "PG-13",
        "Title": "The Lord of the Rings: The Fellowship of the Ring",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 168,
        "Plot": "Camp counselors are stalked and murdered by an unknown assailant while trying to reopen a summer camp that was the site of a child's drowning.",
        "Rating": "X",
        "Title": "Friday the 13th",
        "Year": "1980"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, Thriller",
        "MovieID": 169,
        "Plot": "Based on the true story of the Black September aftermath, about the five men chosen to eliminate the ones responsible for that fateful day.",
        "Rating": "R",
        "Title": "Munich",
        "Year": "2005"
    },
    {
        "Copies": "2",
        "Genre": "Drama, Fantasy, Horror",
        "MovieID": 170,
        "Plot": "A vampire tells his epic life story: love, betrayal, loneliness, and hunger. ",
        "Rating": "R",
        "Title": "Interview with the Vampire: The Vampire Chronicles",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 171,
        "Plot": "Stuart Shepard finds himself trapped in a phone booth, pinned down by an extortionist's sniper rifle.",
        "Rating": "R",
        "Title": "Phone Booth",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 172,
        "Plot": "A man who loves games and theater invites his wife's lover to meet him, setting up a battle of wits with potentially deadly results.",
        "Rating": "PG",
        "Title": "Sleuth",
        "Year": "1972"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy, War",
        "MovieID": 173,
        "Plot": "In the fascist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.",
        "Rating": "R",
        "Title": "Pan's Labyrinth",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Family",
        "MovieID": 174,
        "Plot": "The Tramp goes to the Klondike in search of gold and finds it and more.",
        "Rating": "Not Rated",
        "Title": "The Gold Rush",
        "Year": "1925"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 175,
        "Plot": "A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade where he lives.",
        "Rating": "PG",
        "Title": "Wreck-It Ralph",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Horror, Musical",
        "MovieID": 176,
        "Plot": "Sea creatures created from radioactive sludge terrorize a beach community.",
        "Rating": "Approved",
        "Title": "The Horror of Party Beach",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Fantasy",
        "MovieID": 177,
        "Plot": "A son tries to learn more about his dying father by reliving stories and myths he told about his life.",
        "Rating": "PG-13",
        "Title": "Big Fish",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, War",
        "MovieID": 178,
        "Plot": "A ruthlessly ambitious Scottish lord siezes the throne with the help of his scheming wife and a trio of witches.",
        "Rating": "R",
        "Title": "Macbeth",
        "Year": "1971"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 179,
        "Plot": "Los Angeles citizens with vastly separate lives collide in interweaving stories of race, loss and redemption.",
        "Rating": "R",
        "Title": "Crash",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi",
        "MovieID": 180,
        "Plot": "After enslavement & near extermination by an alien race in the year 3000, humanity begins to fight back.",
        "Rating": "PG-13",
        "Title": "Battlefield Earth",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Fantasy",
        "MovieID": 181,
        "Plot": "Teenagers stumble across a prehistoric caveman, who goes on a rampage.",
        "Rating": "Unrated",
        "Title": "Eegah",
        "Year": "1962"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Fantasy",
        "MovieID": 182,
        "Plot": "A puppeteer discovers a portal that leads literally into the head of the movie star, John Malkovich.",
        "Rating": "R",
        "Title": "Being John Malkovich",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 183,
        "Plot": "An eight year old boy is thought to be lazy and a troublemaker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.",
        "Rating": "PG",
        "Title": "Like Stars on Earth",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Action, Horror, Thriller",
        "MovieID": 184,
        "Plot": "A marine biologist, a dolphin trainer, a research scientist, and a local sheriff try to hunt down a large sea monster, a shark/octopus hybrid, that is devouring swimmers and fishermen off a south Florida coast.",
        "Rating": "R",
        "Title": "Devil Fish",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 185,
        "Plot": "The story of King George VI of the United Kingdom of Great Britain and Northern Ireland, his impromptu ascension to the throne and the speech therapist who helped the unsure monarch become worthy of it.",
        "Rating": "R",
        "Title": "The King's Speech",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 186,
        "Plot": "A poor Midwest family is forced off of their land. They travel to California, suffering the misfortunes of the homeless in the Great Depression.",
        "Rating": "Not Rated",
        "Title": "The Grapes of Wrath",
        "Year": "1940"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 187,
        "Plot": "An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.",
        "Rating": "R",
        "Title": "The Wild Bunch",
        "Year": "1969"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 188,
        "Plot": "After rescuing Han Solo from the palace of Jabba the Hutt, the Rebels attempt to destroy the Second Death Star, while Luke Skywalker tries to bring his father back to the Light Side of the Force.",
        "Rating": "PG",
        "Title": "Star Wars: Episode VI - Return of the Jedi",
        "Year": "1983"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime, Romance",
        "MovieID": 189,
        "Plot": "The violent story about how a criminal lesbian, a tough-guy hit-man with a heart of gold, and a mentally challenged man came to be best friends through a hostage.",
        "Rating": "R",
        "Title": "Gigli",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 190,
        "Plot": "The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba.",
        "Rating": "R",
        "Title": "The Godfather: Part II",
        "Year": "1974"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama",
        "MovieID": 191,
        "Plot": "A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.",
        "Rating": "Unrated",
        "Title": "Seven Samurai",
        "Year": "1954"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 192,
        "Plot": "\"Dude\" Lebowski, mistaken for a millionaire Lebowski, seeks restitution for his ruined rug and enlists his bowling buddies to help get it.",
        "Rating": "R",
        "Title": "The Big Lebowski",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Fantasy",
        "MovieID": 193,
        "Plot": "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.",
        "Rating": "PG",
        "Title": "Life of Pi",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 194,
        "Plot": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don Michael Corleone seeks to vow for his sins while taking a young protégé under his wing.",
        "Rating": "R",
        "Title": "The Godfather: Part III",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, War",
        "MovieID": 195,
        "Plot": "After settling his differences with a Japanese PoW camp commander, a British colonel co-operates to oversee his men's construction of a railway bridge for their captors - while oblivious to a plan by the Allies to destroy it.",
        "Rating": "PG",
        "Title": "The Bridge on the River Kwai",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 196,
        "Plot": "Biography of Mohandas K. Gandhi, the lawyer who became the famed leader of the Indian revolts against the British rule through his philosophy of nonviolent protest.",
        "Rating": "PG",
        "Title": "Gandhi",
        "Year": "1982"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure",
        "MovieID": 197,
        "Plot": "Archeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis.",
        "Rating": "PG",
        "Title": "Raiders of the Lost Ark",
        "Year": "1981"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 198,
        "Plot": "Title character Sebastian Stark is an L.A. hot-shot lawyer, who leaves his lucrative career as defender of rich criminals to join the public prosecution under the District Attorney (D.A.), ...",
        "Rating": "N/A",
        "Title": "Shark",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Action, Horror",
        "MovieID": 199,
        "Plot": "Based on the video game, Alone in the Dark focuses on Edward Carnby, a detective of the paranormal, who slowly unravels a mysterious events with deadly results.",
        "Rating": "R",
        "Title": "Alone in the Dark",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Musical",
        "MovieID": 200,
        "Plot": "An east European girl goes to America with her young son, expecting it to be like a Hollywood film.",
        "Rating": "R",
        "Title": "Dancer in the Dark",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama",
        "MovieID": 201,
        "Plot": "A teenager with a massive facial skull deformity and biker gang mother attempts to live as normal a life as possible under the circumstances.",
        "Rating": "R",
        "Title": "Mask",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 202,
        "Plot": "The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful, time-traveling Romulan creates black holes to destroy the Federation one planet at a time.",
        "Rating": "PG-13",
        "Title": "Star Trek",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 203,
        "Plot": "After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.",
        "Rating": "PG",
        "Title": "Star Wars: Episode V - The Empire Strikes Back",
        "Year": "1980"
    },
    {
        "Copies": "2",
        "Genre": "Animation, Adventure, Family ",
        "MovieID": 204,
        "Plot": "Little Jack is a young fox living happily with his family in the woods, but everything changes when his father is captured by a circus troupe in order to be part of their show. The rest of the animals from the wood will share the same destiny. With the help from a nature-loving disabled boy in a wheelchair and a young acrobat girl, Little Jack will try to rescue the animals. ",
        "Rating": "G",
        "Title": "A Fox'sTale",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Family",
        "MovieID": 205,
        "Plot": "Tim Avery, an aspiring cartoonist, finds himself in a predicament when his dog stumbles upon the mask of Loki. Then after conceiving an infant son \"born of the mask\", he discovers just how looney child raising can be.",
        "Rating": "PG",
        "Title": "Son of the Mask",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Sci-Fi",
        "MovieID": 206,
        "Plot": "During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.",
        "Rating": "PG-13",
        "Title": "Jurassic Park",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 207,
        "Plot": "A television network cynically exploits a deranged former anchor's ravings and revelations about the news media for its own profit.",
        "Rating": "R",
        "Title": "Network",
        "Year": "1976"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 208,
        "Plot": "An idiotic man struggles to make it through life on his own in St. Louis.",
        "Rating": "R",
        "Title": "The Jerk",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Sci-Fi",
        "MovieID": 209,
        "Plot": "A streetwise NYPD detective joins a secret organization that polices extraterrestrial affairs on Earth.",
        "Rating": "PG-13",
        "Title": "Men in Black",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Fantasy",
        "MovieID": 210,
        "Plot": "King Arthur and his knights embark on a low-budget search for the Grail, encountering many very silly obstacles.",
        "Rating": "PG",
        "Title": "Monty Python and the Holy Grail",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 211,
        "Plot": "ANNE B. REAL is the coming of age story of a young female rapper, who finds her inspiration by reading the Diary of Anne Frank.",
        "Rating": "PG-13",
        "Title": "Anne B. Real",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 212,
        "Plot": "A Jewish man has a wonderful romance with the help of his humour, but must use that same quality to protect his son in a Nazi death camp.",
        "Rating": "PG-13",
        "Title": "Life Is Beautiful",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Crime, Film-Noir, Thriller",
        "MovieID": 213,
        "Plot": "A stark, perverse story of murder, kidnapping, and police corruption in a Mexican border town.",
        "Rating": "PG-13",
        "Title": "Touch of Evil",
        "Year": "1958"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 214,
        "Plot": "Neurotic New York comedian Alvy Singer falls in love with the ditsy Annie Hall.",
        "Rating": "PG",
        "Title": "Annie Hall",
        "Year": "1977"
    },
    {
        "Copies": "",
        "Genre": "Crime, Action, Drama",
        "MovieID": 215,
        "Plot": "A sleazy, incompetent detective tries to simultaneously take down heroin dealers and a socialite who murdered a burglar.",
        "Rating": "R",
        "Title": "Mitchell",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy",
        "MovieID": 216,
        "Plot": "A man seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague.",
        "Rating": "Not Rated",
        "Title": "The Seventh Seal",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 217,
        "Plot": "Henry has been acting the human chameleon all his life - a pale reflection of other people's expectations. One day Henry's best friend Jon talks him into opening a restaurant with him in ...",
        "Rating": "N/A",
        "Title": "Original",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 218,
        "Plot": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.",
        "Rating": "R",
        "Title": "Downfall",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance, Sport",
        "MovieID": 219,
        "Plot": "Regina, the once popular girl has to make new friends at her new, conservative school. Problems arrive when she becomes enemies with Lívia, the school's queen bee, and falls in love with ...",
        "Rating": "N/A",
        "Title": "Dream Well",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 220,
        "Plot": "Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.",
        "Rating": "PG-13",
        "Title": "Pirates of the Caribbean: The Curse of the Black Pearl",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 221,
        "Plot": "Chaos ensues when a man tries to expose a dark secret regarding a recently deceased patriarch of a dysfunctional British family.",
        "Rating": "R",
        "Title": "Death at a Funeral",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Comedy",
        "MovieID": 222,
        "Plot": "When Union spies steal an engineer's beloved locomotive, he pursues it single handedly and straight through enemy lines.",
        "Rating": "Unrated",
        "Title": "The General",
        "Year": "1926"
    },
    {
        "Copies": "",
        "Genre": "Action, Thriller",
        "MovieID": 223,
        "Plot": "Bond's loyalty to M is tested when her past comes back to haunt her. Whilst MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.",
        "Rating": "PG-13",
        "Title": "Skyfall",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Drama, Thriller",
        "MovieID": 224,
        "Plot": "A young girl is recruited from the bottom rung of society into a ruthless world where power can get you anything.",
        "Rating": "N/A",
        "Title": "Call Girl",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Animation, Comedy, Drama",
        "MovieID": 225,
        "Plot": "An animated retelling of Charles Dickens' classic novel about a Victorian-era miser taken on a journey of self-redemption, courtesy of several mysterious Christmas apparitions.",
        "Rating": "PG",
        "Title": "A Christmas Carol",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Drama, History",
        "MovieID": 226,
        "Plot": "A chronicle of the events that led to the founding of the Chinese Communist Party.",
        "Rating": "N/A",
        "Title": "Beginning of the Great Revival",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 227,
        "Plot": "Erik is expelled from school for fighting. He ends up at a private boarding school where the senior students control the young ones. Erik finds a friend in Pierre, his room mate. The story ...",
        "Rating": "Not Rated",
        "Title": "Evil",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Sport",
        "MovieID": 228,
        "Plot": "Oakland A's general manager Billy Beane's successful attempt to assemble a baseball team on a lean budget by employing computer-generated analysis to acquire new players.",
        "Rating": "PG-13",
        "Title": "Moneyball",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 229,
        "Plot": "Hannibal returns to America and attempts to make contact with disgraced Agent Starling and survive a vengeful victim's plan.",
        "Rating": "R",
        "Title": "Hannibal",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Sport",
        "MovieID": 230,
        "Plot": "An emotionally self-destructive boxer's journey through life, as the violence and temper that leads him to the top in the ring, destroys his life outside it.",
        "Rating": "R",
        "Title": "Raging Bull",
        "Year": "1980"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Sport",
        "MovieID": 231,
        "Plot": "A rag-tag bunch of seniors, complete outsiders at their surf-crazed Laguna Beach High School, decide to crash the biggest team surf contest. In order to prevail, however, they must do one ...",
        "Rating": "R",
        "Title": "Surf School",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 232,
        "Plot": "As corruption grows in 1950s LA, three policemen - the straight-laced, the brutal, and the sleazy - investigate a series of murders with their own brand of justice.",
        "Rating": "R",
        "Title": "L.A. Confidential",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": null,
        "MovieID": 233,
        "Plot": null,
        "Rating": "R",
        "Title": "Léon: The Professional",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Action, Horror, Sci-Fi",
        "MovieID": 234,
        "Plot": "A special military unit fights a powerful, out-of-control supercomputer and hundreds of scientists who have mutated into flesh-eating creatures after a laboratory accident.",
        "Rating": "R",
        "Title": "Resident Evil",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy, Thriller",
        "MovieID": 235,
        "Plot": "DD is a smug fellow, almost 30 years of age, who can manage all by himself. At least that's what he thinks. However, a strange woman - Lova - enters his life, hunted by evil men who want to...",
        "Rating": "N/A",
        "Title": "Storm",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 236,
        "Plot": "The drug-induced utopias of four Coney Island people are shattered when their addictions become stronger.",
        "Rating": "R",
        "Title": "Requiem for a Dream",
        "Year": "2000"
    },
    {
        "Copies": "4",
        "Genre": "Drama, Film-Noir, Thriller ",
        "MovieID": 237,
        "Plot": "In this Americanization of the 1931 German thriller, both the police and the criminal underworld stalk a mysterious killer who preys on small children. ",
        "Rating": "Not Rated",
        "Title": "M",
        "Year": "1951"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 238,
        "Plot": "1973, suburban Connecticut: middle class families experimenting with casual sex, drink, etc., find their lives out of control.",
        "Rating": "R",
        "Title": "The Ice Storm",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 239,
        "Plot": "Jason Bourne dodges a ruthless CIA official and his agents from a new assassination program while searching for the origins of his life as a trained killer.",
        "Rating": "PG-13",
        "Title": "The Bourne Ultimatum",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Action, Biography, Drama",
        "MovieID": 240,
        "Plot": "A semi-biographical account of Yip Man, the first martial arts master to teach the Chinese martial art of Wing Chun.",
        "Rating": "R",
        "Title": "Ip Man",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Horror, Sci-Fi",
        "MovieID": 241,
        "Plot": "The commercial vessel Nostromo receives a distress call from an unexplored planet. After searching for survivors, the crew heads home only to realize that a deadly bioform has joined them.",
        "Rating": "R",
        "Title": "Alien",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 242,
        "Plot": "A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.",
        "Rating": "PG-13",
        "Title": "A Separation",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 243,
        "Plot": "A psycho cop with a weakness for killing his female arrests gets what's coming to him when a pack of zombie women rise from their graves in order to get proper revenge.",
        "Rating": "R",
        "Title": "Zombie Nation",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 244,
        "Plot": "The incredibly spoiled and overprivileged students of Camden College are a backdrop for an unusual love triangle between a drug dealer, a virgin and a bisexual classmate.",
        "Rating": "R",
        "Title": "The Rules of Attraction",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 245,
        "Plot": "Brian is born on the original Christmas, in the stable next door. He spends his life being mistaken for a messiah.",
        "Rating": "R",
        "Title": "Life of Brian",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Action, Fantasy",
        "MovieID": 246,
        "Plot": "The Dark Knight of Gotham City begins his war on crime with his first major enemy being the clownishly homicidal Joker.",
        "Rating": "PG-13",
        "Title": "Batman",
        "Year": "1989"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime, Drama",
        "MovieID": 247,
        "Plot": "Posing as a movie producer, a robber cons an entire village to help him rob a treasure-laden train.",
        "Rating": "N/A",
        "Title": "Tees Maar Khan",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 248,
        "Plot": "At Helge's 60th birthday party, some unpleasant family truths are revealed.",
        "Rating": "R",
        "Title": "The Celebration",
        "Year": "1998"
    },
    {
        "Copies": "4",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 249,
        "Plot": "During the near end of the clone wars, Darth Sidious has revealed himself and is ready to execute the last part of his plan to rule the Galaxy. Sidious is ready for his new apprentice, Lord Vader, to step into action and kill the remaining Jedi. Vader, however, struggles to choose the dark side and save his wife or remain loyal to the Jedi order. ",
        "Rating": "PG-13",
        "Title": "Star Wars: Episode III - Revenge of the Sith",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, War",
        "MovieID": 250,
        "Plot": "A mill owner in the Sudetenland and his family's lives are changed as Europe heats up in 1938.",
        "Rating": "N/A",
        "Title": "Habermann",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Comedy",
        "MovieID": 251,
        "Plot": "Three young boys, Rocky, Colt and Tum Tum together with their neighbor girl, computer whiz Amanda are visiting Mega Mountain amusement park when it is invaded by an army of ninjas led by ...",
        "Rating": "PG",
        "Title": "3 Ninjas: High Noon at Mega Mountain",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Film-Noir",
        "MovieID": 252,
        "Plot": "A private detective takes on a case that involves him with three eccentric criminals, a gorgeous liar, and their quest for a priceless statuette.",
        "Rating": "Not Rated",
        "Title": "The Maltese Falcon",
        "Year": "1941"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 253,
        "Plot": "A man in a legal but hurtful business needs an escort for some social events, and hires a beautiful prostitute he meets... only to fall in love.",
        "Rating": "R",
        "Title": "Pretty Woman",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, War",
        "MovieID": 254,
        "Plot": "An elderly lord abdicates to his three sons, and the two corrupt ones turn against him.",
        "Rating": "R",
        "Title": "Ran",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 255,
        "Plot": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country.",
        "Rating": "R",
        "Title": "Rain Man",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Crime, Mystery, Thriller",
        "MovieID": 256,
        "Plot": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.",
        "Rating": "R",
        "Title": "Se7en",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 257,
        "Plot": "Leonard Vole is arrested on suspicion of murdering an elderly acquaintance. He employs an experienced but aging barrister as his defense attorney.",
        "Rating": "Approved",
        "Title": "Witness for the Prosecution",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, War",
        "MovieID": 258,
        "Plot": "A young recruit in Vietnam faces a moral crisis when confronted with the horrors of war and the duality of man.",
        "Rating": "R",
        "Title": "Platoon",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 259,
        "Plot": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.",
        "Rating": "R",
        "Title": "Black Swan",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 260,
        "Plot": "A naive man is appointed to fill a vacancy in the US Senate. His plans promptly collide with political corruption, but he doesn't back down.",
        "Rating": "Not Rated",
        "Title": "Mr. Smith Goes to Washington",
        "Year": "1939"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 261,
        "Plot": "An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England.",
        "Rating": "PG",
        "Title": "Barry Lyndon",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Crime, Film-Noir, Thriller",
        "MovieID": 262,
        "Plot": "A psychotic socialite confronts a pro tennis star with a theory on how two complete strangers can get away with murder...a theory that he plans to implement.",
        "Rating": "PG",
        "Title": "Strangers on a Train",
        "Year": "1951"
    },
    {
        "Copies": "",
        "Genre": "Short, Action, Adventure",
        "MovieID": 263,
        "Plot": "A young twenty-something diver living in the Florida Keys discovers he has the power to breathe underwater.",
        "Rating": "N/A",
        "Title": "Aquaman",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 264,
        "Plot": "A man robs a bank to pay for his lover's operation; it turns into a hostage situation and a media circus.",
        "Rating": "R",
        "Title": "Dog Day Afternoon",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 265,
        "Plot": "The lives of two mob hit men, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "Rating": "R",
        "Title": "Pulp Fiction",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 266,
        "Plot": "Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.",
        "Rating": "R",
        "Title": "No Country for Old Men",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family",
        "MovieID": 267,
        "Plot": "With his wife doing a book tour, a father of twelve must handle a new job and his unstable brood.",
        "Rating": "PG",
        "Title": "Cheaper by the Dozen",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 268,
        "Plot": "Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner and a young man.",
        "Rating": "R",
        "Title": "Unforgiven",
        "Year": "1992"
    },
    {
        "Copies": "",
        "Genre": "Biography, Crime, Drama",
        "MovieID": 269,
        "Plot": "A true story about Frank Abagnale Jr., who, before his 19th birthday, successfully conned millions of dollars' worth of checks as a Pan Am pilot, doctor, and legal prosecutor.",
        "Rating": "PG-13",
        "Title": "Catch Me If You Can",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Fantasy",
        "MovieID": 270,
        "Plot": "In a twist to the fairy tale, the Huntsman ordered to take Snow White into the woods to be killed winds up becoming her protector and mentor in a quest to vanquish the Evil Queen.",
        "Rating": "PG-13",
        "Title": "Snow White and the Huntsman",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy, Adventure",
        "MovieID": 271,
        "Plot": "The pointlessly named Batwoman and her bevy of Batmaidens fight evil and dance.",
        "Rating": "N/A",
        "Title": "The Wild World of Batwoman",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Drama, Western",
        "MovieID": 272,
        "Plot": "A marshall, personally compelled to face a returning deadly enemy, finds that his own town refuses to help him.",
        "Rating": "PG",
        "Title": "High Noon",
        "Year": "1952"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 273,
        "Plot": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
        "Rating": "R",
        "Title": "The Shawshank Redemption",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 274,
        "Plot": "After discovering that an asteroid the size of Texas is going to impact Earth in less than a month, N.A.S.A. recruits a misfit team of deep core drillers to save the planet.",
        "Rating": "PG-13",
        "Title": "Armageddon",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, Romance",
        "MovieID": 275,
        "Plot": "As students at the Navy's elite fighter weapons school compete to be best in the class, one daring young flyer learns a few things from a civilian instructor that are not taught in the classroom.",
        "Rating": "PG",
        "Title": "Top Gun",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 276,
        "Plot": "A young man meets a farm girl who is actually a witch.",
        "Rating": "PG",
        "Title": "The Touch of Satan",
        "Year": "1971"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, War",
        "MovieID": 277,
        "Plot": "123 elite U.S. soldiers drop into Somalia to capture two top lieutenants of a renegade warlord and find themselves in a desperate battle with a large force of heavily-armed Somalis.",
        "Rating": "R",
        "Title": "Black Hawk Down",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 278,
        "Plot": "The life of a divorced television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
        "Rating": "R",
        "Title": "Manhattan",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Crime, Thriller",
        "MovieID": 279,
        "Plot": "Danny Ocean and his eleven accomplices plan to rob three Las Vegas casinos simultaneously.",
        "Rating": "PG-13",
        "Title": "Ocean's Eleven",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 280,
        "Plot": "A heinous crime and its aftermath are recalled from differing points of view.",
        "Rating": "Unrated",
        "Title": "Rashomon",
        "Year": "1950"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, War",
        "MovieID": 281,
        "Plot": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.",
        "Rating": "R",
        "Title": "Saving Private Ryan",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Fantasy",
        "MovieID": 282,
        "Plot": "When bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.",
        "Rating": "PG-13",
        "Title": "Spider-Man",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Sci-Fi",
        "MovieID": 283,
        "Plot": "When a group of trespassing seniors swim in a pool containing alien cocoons, they find themselves energized with youthful vigour.",
        "Rating": "PG-13",
        "Title": "Cocoon",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 284,
        "Plot": "Balian of Ibelin travels to Jerusalem during the crusades of the 12th century, and there he finds himself as the defender of the city and its people.",
        "Rating": "R",
        "Title": "Kingdom of Heaven",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Biography, Crime, Drama",
        "MovieID": 285,
        "Plot": "A man befriends a fellow criminal as the two of them begin serving their sentence on a dreadful prison island, which inspires the man to plot his escape.",
        "Rating": "R",
        "Title": "Papillon",
        "Year": "1973"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 286,
        "Plot": "Low-budget film about a young man given a mystical medallion by an Aztec shaman, in order to become a puma-empowered champion like his father before him. In trying to initially locate the ...",
        "Rating": "N/A",
        "Title": "The Pumaman",
        "Year": "1980"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Mystery",
        "MovieID": 287,
        "Plot": "A skilled extractor is offered a chance to regain his old life as payment for a task considered to be impossible.",
        "Rating": "PG-13",
        "Title": "Inception",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama",
        "MovieID": 288,
        "Plot": "A Victorian surgeon rescues a heavily disfigured man who is mistreated while scraping a living as a side-show freak. Behind his monstrous facade, there is revealed a person of intelligence and sensitivity.",
        "Rating": "PG",
        "Title": "The Elephant Man",
        "Year": "1980"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sci-Fi, Thriller",
        "MovieID": 289,
        "Plot": "In 2027, in a chaotic world in which women have become somehow infertile, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea.",
        "Rating": "R",
        "Title": "Children of Men",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 290,
        "Plot": "Follows the plot of Pulp Fiction, also parodying scenes from other movies.",
        "Rating": "R",
        "Title": "Plump Fiction",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 291,
        "Plot": "A private detective hired to expose an adulterer finds himself caught up in a web of deceit, corruption and murder.",
        "Rating": "R",
        "Title": "Chinatown",
        "Year": "1974"
    },
    {
        "Copies": "",
        "Genre": "Action, Thriller",
        "MovieID": 292,
        "Plot": "A veteran cop, Murtaugh, is partnered with a young suicidal cop, Riggs. Both having one thing in common; hating working in pairs. Now they must learn to work with one another to stop a gang of drug smugglers.",
        "Rating": "R",
        "Title": "Lethal Weapon",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 293,
        "Plot": "A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself, and learns there may be more to the creatures than he assumed.",
        "Rating": "PG",
        "Title": "How to Train Your Dragon",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 294,
        "Plot": "A dissenting juror in a murder trial slowly manages to convince the others that the case is not as obviously clear as it seemed in court.",
        "Rating": "Not Rated",
        "Title": "12 Angry Men",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Musical, Romance",
        "MovieID": 295,
        "Plot": "A silent film production company and cast make a difficult transition to sound.",
        "Rating": "Approved",
        "Title": "Singin' in the Rain",
        "Year": "1952"
    },
    {
        "Copies": "",
        "Genre": "Film-Noir, Mystery, Thriller",
        "MovieID": 296,
        "Plot": "Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, black-market opportunist Harry Lime.",
        "Rating": "Not Rated",
        "Title": "The Third Man",
        "Year": "1949"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, Romance",
        "MovieID": 297,
        "Plot": "Life of a Russian doctor/poet who, although married, falls for a political activist's wife and experiences hardships during the Bolshevik Revolution.",
        "Rating": "PG-13",
        "Title": "Doctor Zhivago",
        "Year": "1965"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 298,
        "Plot": "Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.",
        "Rating": "R",
        "Title": "Gran Torino",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, History",
        "MovieID": 299,
        "Plot": "A defense officer, Nameless, was summoned by the King of Qin regarding his success of terminating three warriors.",
        "Rating": "PG-13",
        "Title": "Hero",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 300,
        "Plot": "A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he escalates deeper into his illogical, gratuitous fantasies.",
        "Rating": "R",
        "Title": "American Psycho",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 301,
        "Plot": "Suburban priest falls in love with woman in wheelchair.",
        "Rating": "N/A",
        "Title": "Miffo",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Romance, Thriller",
        "MovieID": 302,
        "Plot": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
        "Rating": "Approved",
        "Title": "Vertigo",
        "Year": "1958"
    },
    {
        "Copies": "",
        "Genre": "Biography, Crime, Drama",
        "MovieID": 303,
        "Plot": "Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.",
        "Rating": "R",
        "Title": "Casino",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 304,
        "Plot": "A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist.",
        "Rating": "R",
        "Title": "Cinema Paradiso",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Comedy",
        "MovieID": 305,
        "Plot": "A young movie fan gets thrown into the movie world of his favourite action film character.",
        "Rating": "PG-13",
        "Title": "Last Action Hero",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 306,
        "Plot": "A man, suffering from short-term memory loss, uses notes and tattoos to hunt for the man he thinks killed his wife.",
        "Rating": "R",
        "Title": "Memento",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi, Horror",
        "MovieID": 307,
        "Plot": "A space capsule crash-lands, and the astronaut aboard disappears. Is there a connection between the missing man and the monster roaming the area?",
        "Rating": "TV-PG",
        "Title": "Monster a-Go Go",
        "Year": "1965"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 308,
        "Plot": "A gunslinger is embroiled in a war with a local drug runner.",
        "Rating": "R",
        "Title": "Desperado",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Horror, Mystery, Thriller",
        "MovieID": 309,
        "Plot": "A Phoenix secretary steals $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother.",
        "Rating": "TV-14",
        "Title": "Psycho",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Sci-Fi",
        "MovieID": 310,
        "Plot": "A troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes, after narrowly escaping a bizarre accident.",
        "Rating": "R",
        "Title": "Donnie Darko",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 311,
        "Plot": "Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson.",
        "Rating": "R",
        "Title": "Fargo",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 312,
        "Plot": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.",
        "Rating": "G",
        "Title": "Finding Nemo",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 313,
        "Plot": "Acting under the cover of a Hollywood producer scouting a location for a science fiction film, a CIA agent launches a dangerous operation to rescue six Americans in Tehran during the U.S. hostage crisis in Iran in 1980.",
        "Rating": "R",
        "Title": "Argo",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure",
        "MovieID": 314,
        "Plot": "A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town.",
        "Rating": "Unrated",
        "Title": "Yojimbo",
        "Year": "1961"
    },
    {
        "Copies": "",
        "Genre": "Animation, Family, Fantasy",
        "MovieID": 315,
        "Plot": "When two girls move to the country to be near their ailing mother, they have adventures with the wonderous forest spirits who live nearby.",
        "Rating": "G",
        "Title": "My Neighbor Totoro",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 316,
        "Plot": "Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him.",
        "Rating": "PG-13",
        "Title": "Forrest Gump",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 317,
        "Plot": "An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African-American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis.",
        "Rating": "PG-13",
        "Title": "The Help",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Drama",
        "MovieID": 318,
        "Plot": "By tying thousands of balloons to his home, 78-year-old Carl sets out to fulfill his lifelong dream to see the wilds of South America. Russell, a wilderness explorer 70 years younger, inadvertently becomes a stowaway.",
        "Rating": "PG",
        "Title": "Up",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Film-Noir, Mystery",
        "MovieID": 319,
        "Plot": "Private detective Philip Marlowe is hired by a rich family. Before the complex case is over, he's seen murder, blackmail, and what might be love.",
        "Rating": "Not Rated",
        "Title": "The Big Sleep",
        "Year": "1946"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sci-Fi, Thriller",
        "MovieID": 320,
        "Plot": "A blade runner must pursue and try to terminate four replicants who stole a ship in space and have returned to Earth to find their creator.",
        "Rating": "R",
        "Title": "Blade Runner",
        "Year": "1982"
    },
    {
        "Copies": "",
        "Genre": "Crime",
        "MovieID": 321,
        "Plot": "A young man who works at a nursing home uses the legendary Zodiac killer's M.O. to kill people who neglect their elderly relatives.",
        "Rating": "R",
        "Title": "Ulli Lommel's Zodiac Killer",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Horror, Sci-Fi, Thriller",
        "MovieID": 322,
        "Plot": "This high-tech, psychological thriller is set in the shadowy world of the Internet. Sondra Brummel is recovering from a skiing accident in her boyfriend's mansion, and accidently contacts a...",
        "Rating": "Unrated",
        "Title": ".com for Murder",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 323,
        "Plot": "With a childhood tragedy that overshadowed their lives, three men are reunited by circumstance when one loses a daughter.",
        "Rating": "R",
        "Title": "Mystic River",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 324,
        "Plot": "This film is about a man whose job is to deliver packages without asking any questions. Complications arise when he breaks those rules.",
        "Rating": "PG-13",
        "Title": "The Transporter",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Romance",
        "MovieID": 325,
        "Plot": "The three-year romance between 19th century poet John Keats and Fanny Brawne.",
        "Rating": "PG",
        "Title": "Bright Star",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 326,
        "Plot": "Jacob Katadreuffe lives mute with his mother, has no contact with his father who only works against him and wants to become a lawyer, at all costs.",
        "Rating": "R",
        "Title": "Character",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sport",
        "MovieID": 327,
        "Plot": "A faded professional wrestler must retire, but finds his quest for a new life outside the ring a dispiriting struggle.",
        "Rating": "R",
        "Title": "The Wrestler",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Romance",
        "MovieID": 328,
        "Plot": "A teenage girl's life gets turned upside down when a new school friend turns out to be a pop star.",
        "Rating": "PG",
        "Title": "Popstar",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sport",
        "MovieID": 329,
        "Plot": "An up-and-coming pool player plays a long-time champion in a single high-stakes match.",
        "Rating": "Unrated",
        "Title": "The Hustler",
        "Year": "1961"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sport",
        "MovieID": 330,
        "Plot": "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision corner with his older brother.",
        "Rating": "PG-13",
        "Title": "Warrior",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Horror, Thriller",
        "MovieID": 331,
        "Plot": "A lonely boy becomes good friends with Ben, a rat. This rat is also the leader of a pack of vicious killer rats, killing lots of people.",
        "Rating": "PG",
        "Title": "Ben",
        "Year": "1972"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama",
        "MovieID": 332,
        "Plot": "When a Jewish prince is betrayed and sent into slavery by a Roman friend, he regains his freedom and comes back for revenge.",
        "Rating": "TV-PG",
        "Title": "Ben-Hur",
        "Year": "1959"
    },
    {
        "Copies": "",
        "Genre": "Documentary",
        "MovieID": 333,
        "Plot": "",
        "Rating": "N/A",
        "Title": "Japan: Sword and the Chrysanthemum",
        "Year": "1988"
    },
    {
        "Copies": "2",
        "Genre": "Crime, Drama, Fantasy",
        "MovieID": 334,
        "Plot": "Jean-Baptiste Grenouille, born with a superior olfactory sense, creates the world's finest perfume. His work, however, takes a dark turn as he searches for the ultimate scent. ",
        "Rating": "R",
        "Title": "Perfume: The Story of a Murder",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 335,
        "Plot": "In a murder trial, the defendant says he suffered temporary insanity after the victim raped his wife. What is the truth, and will he win his case?",
        "Rating": "Unrated",
        "Title": "Anatomy of a Murder",
        "Year": "1959"
    },
    {
        "Copies": "2",
        "Genre": "Comedy, Crime, Fantasy",
        "MovieID": 336,
        "Plot": "Evil assassins want to kill Daniel Kublbock, the third runner up for the German Idols. ",
        "Rating": "Not Rated",
        "Title": "Daniel - Der Zauberer",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 337,
        "Plot": "A mentally unstable Vietnam war veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feeds his urge for violent action, attempting to save a preadolescent prostitute in the process.",
        "Rating": "R",
        "Title": "Taxi Driver",
        "Year": "1976"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 338,
        "Plot": "A defense attorney has a crisis of conscience when he represents a wealthy client who has a foolproof plan to beat the system.",
        "Rating": "R",
        "Title": "The Lincoln Lawyer",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Crime, Film-Noir, Thriller",
        "MovieID": 339,
        "Plot": "A religious fanatic marries a gullible widow whose young children are reluctant to tell him where their real daddy hid $10,000 he'd stolen in a robbery.",
        "Rating": "Approved",
        "Title": "The Night of the Hunter",
        "Year": "1955"
    },
    {
        "Copies": "",
        "Genre": "Horror, Romance, Thriller",
        "MovieID": 340,
        "Plot": "A platoon of eagles and vultures attacks the residents of a small town. Many people die. It's not known what caused the flying menace to attack. Two people manage to fight back, but will they survive Birdemic?",
        "Rating": "Not Rated",
        "Title": "Birdemic: Shock and Terror",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 341,
        "Plot": "A semi-autobiographical story about Dolan as a young homosexual at odds with his mother.",
        "Rating": "Not Rated",
        "Title": "I Killed My Mother",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 342,
        "Plot": "Two counterculture bikers travel from Los Angeles to New Orleans in search of America.",
        "Rating": "R",
        "Title": "Easy Rider",
        "Year": "1969"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sci-Fi",
        "MovieID": 343,
        "Plot": "A guide leads two men through an area known as the Zone to find a room that grants wishes.",
        "Rating": "Not Rated",
        "Title": "Stalker",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi",
        "MovieID": 344,
        "Plot": "A human-looking indestructible cyborg is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs.",
        "Rating": "R",
        "Title": "The Terminator",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 345,
        "Plot": "When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.",
        "Rating": "R",
        "Title": "Gladiator",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Fantasy, Horror",
        "MovieID": 346,
        "Plot": "Four teenagers are killed in a car accident. Two of the teenagers refuse to go with \"The Grim Reaper\" and a race between life and death ensues!",
        "Rating": "R",
        "Title": "Soultaker",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 347,
        "Plot": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
        "Rating": "R",
        "Title": "The Godfather",
        "Year": "1972"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Family, Fantasy",
        "MovieID": 348,
        "Plot": "It's Harry's third year at Hogwarts; not only does he have a new \"Defense Against the Dark Arts\" teacher, but there is also trouble brewing. Convicted murderer Sirius Black has escaped the Wizards' Prison and is coming after Harry.",
        "Rating": "PG",
        "Title": "Harry Potter and the Prisoner of Azkaban",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 349,
        "Plot": "Muscle-bound Ator and his mute Asian sidekick travel from the ends of the Earth to save his aged mentor from the evil mustachioed Zor.",
        "Rating": "PG",
        "Title": "The Blade Master",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 350,
        "Plot": "An arms dealer confronts the morality of his work as he is being chased by an Interpol agent.",
        "Rating": "R",
        "Title": "Lord of War",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi, Horror",
        "MovieID": 351,
        "Plot": "A newlywed sheriff tries to stop a shambling monster that has emerged from a spaceship to eat people.",
        "Rating": "N/A",
        "Title": "The Creeping Terror",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Action, Sport",
        "MovieID": 352,
        "Plot": "A naturally talented basketball player, Noah Cruise is determined to become a doctor using his basketball scholarship to UCLA pre-med, rather than succumb to the lure of former sports agent...",
        "Rating": "PG-13",
        "Title": "Crossover",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 353,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "The Ghost Writer",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Thriller",
        "MovieID": 354,
        "Plot": "A man's coerced confession to an IRA bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.",
        "Rating": "R",
        "Title": "In the Name of the Father",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, War",
        "MovieID": 355,
        "Plot": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
        "Rating": "Approved",
        "Title": "The Great Dictator",
        "Year": "1940"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 356,
        "Plot": "An offbeat romantic comedy about a woman who doesn't believe true love exists, and the young man who falls for her.",
        "Rating": "PG-13",
        "Title": "(500) Days of Summer",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 357,
        "Plot": "Arn, the son of a high-ranking Swedish nobleman is educated in a monastery and sent to the Holy Land as a knight templar to do penance for a forbidden love.",
        "Rating": "N/A",
        "Title": "Arn: The Knight Templar",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Crime, Thriller",
        "MovieID": 358,
        "Plot": "An ex-tennis pro carries out a plot to murder his wife. When things go wrong, he improvises a brilliant plan B.",
        "Rating": "PG",
        "Title": "Dial M for Murder",
        "Year": "1954"
    },
    {
        "Copies": "",
        "Genre": "Biography, Crime, Drama",
        "MovieID": 359,
        "Plot": "In 1970s America, a detective works to bring down the drug empire of Frank Lucas, a heroin kingpin from Manhattan, who is smuggling the drug into the country from the Far East.",
        "Rating": "R",
        "Title": "American Gangster",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 360,
        "Plot": "An in-depth examination of the way that the Vietnam war affects the lives of people in a small industrial town in the USA.",
        "Rating": "R",
        "Title": "The Deer Hunter",
        "Year": "1978"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Comedy",
        "MovieID": 361,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "Yes Sir",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 362,
        "Plot": "A just-divorced man must learn to care for his son on his own, and then must fight in court to keep custody of him.",
        "Rating": "Approved",
        "Title": "Kramer vs. Kramer",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 363,
        "Plot": "In 1986, in the province of Gyunggi, in South Korea, a second young and beautiful woman is found dead, raped and tied and gagged with her underwear. Detective Park Doo-Man and Detective Cho...",
        "Rating": "Unrated",
        "Title": "Memories of Murder",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 364,
        "Plot": "An introvert freshman is taken under the wings of two seniors who welcome him to the real world.",
        "Rating": "PG-13",
        "Title": "The Perks of Being a Wallflower",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Drama, Horror, Musical",
        "MovieID": 365,
        "Plot": "The infamous story of Benjamin Barker, a.k.a Sweeney Todd, who sets up a barber shop down in London which is the basis for a sinister partnership with his fellow tenant, Mrs. Lovett. Based on the hit Broadway musical.",
        "Rating": "R",
        "Title": "Sweeney Todd: The Demon Barber of Fleet Street",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Music, Romance",
        "MovieID": 366,
        "Plot": "A young singer dates a disc jockey who helps her get into the music business, but their relationship become complicated as she ascends to super stardom.",
        "Rating": "PG-13",
        "Title": "Glitter",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime, Family",
        "MovieID": 367,
        "Plot": "Scientist hold talking, super-intelligent babies captive, but things take a turn for the worse when a mix-up occurs between a baby genius and its twin.",
        "Rating": "PG",
        "Title": "Baby Geniuses",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Comedy, Fantasy",
        "MovieID": 368,
        "Plot": "A spoof that combines Cast Away with Miss Congeniality, Planet of the Apes, Love Boat, Gilligan's Island, The Sixth Sense, Jurassic Park, and more",
        "Rating": "N/A",
        "Title": "Miss Castaway and the Island Girls",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, War",
        "MovieID": 369,
        "Plot": "Twins journey to the Middle East to discover their family history, and fulfill their mother's last wishes.",
        "Rating": "R",
        "Title": "Incendies",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 370,
        "Plot": "Rich and bored aristocrats in Rococo France play high-stakes games of passion and betrayal.",
        "Rating": "R",
        "Title": "Dangerous Liaisons",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Sci-Fi, Thriller",
        "MovieID": 371,
        "Plot": "Katniss Everdeen voluntarily takes her younger sister's place in the Hunger Games, a televised fight to the death in which two teenagers from each of the twelve Districts of Panem are chosen at random to compete.",
        "Rating": "PG-13",
        "Title": "The Hunger Games",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 372,
        "Plot": "A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge.",
        "Rating": "R",
        "Title": "A Fistful of Dollars",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 373,
        "Plot": "Six escaped convicts and their female hostage make a desperate run for the Mexican border, where they stumble across a lost treasure of untold wealth, and find certain death instead on the Arizona desert.",
        "Rating": "Unrated",
        "Title": "Seven Mummies",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 374,
        "Plot": "A account of underground resistance fighters in Nazi-occupied France.",
        "Rating": "Not Rated",
        "Title": "Army of Shadows",
        "Year": "1969"
    },
    {
        "Copies": "",
        "Genre": "Fantasy",
        "MovieID": 375,
        "Plot": "Two creepy \"horror\" films joined together by Merlin's Shop which is, in turn, introduced by a Grandpa telling the story.",
        "Rating": "Unrated",
        "Title": "Merlin's Shop of Mystical Wonders",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama",
        "MovieID": 376,
        "Plot": "In a Napoleonic era insane asylum, an inmate, the irrepressible Marquis De Sade, fights a battle of wills against a tyrannically prudish doctor.",
        "Rating": "R",
        "Title": "Quills",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Crime, Mystery, Thriller",
        "MovieID": 377,
        "Plot": "A boat has been destroyed, criminals are dead, and the key to this mystery lies with the only survivor and his twisted, convoluted story beginning with five career crooks in a seemingly random police lineup.",
        "Rating": "R",
        "Title": "The Usual Suspects",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 378,
        "Plot": "Incompetent cop Frank Drebin has to foil an attempt to assassinate Queen Elizabeth II.",
        "Rating": "PG-13",
        "Title": "The Naked Gun: From the Files of Police Squad!",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Romance",
        "MovieID": 379,
        "Plot": "True story of the lifelong romance between novelist Iris Murdoch and her husband John Bayley, from their student days through her battle with Alzheimer's disease.",
        "Rating": "R",
        "Title": "Iris",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 380,
        "Plot": "A Civil War veteran embarks on a journey to rescue his niece from an Indian tribe.",
        "Rating": "Unrated",
        "Title": "The Searchers",
        "Year": "1956"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 381,
        "Plot": "A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.",
        "Rating": "R",
        "Title": "The Secret in Their Eyes",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Horror, Thriller",
        "MovieID": 382,
        "Plot": "When a gigantic great white shark begins to menace the small island community of Amity, a police chief, a marine scientist and grizzled fisherman set out to stop it.",
        "Rating": "PG",
        "Title": "Jaws",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Fantasy",
        "MovieID": 383,
        "Plot": "After three centuries, three witch sisters are resurrected in Salem Massachusetts on Halloween night, and it is up to two teen-agers, a young girl, and an immortal cat to put an end to the witches' reign of terror once and for all.",
        "Rating": "PG",
        "Title": "Hocus Pocus",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, History",
        "MovieID": 384,
        "Plot": "Federal Agent Eliot Ness sets out to stop Al Capone; because of rampant corruption, he assembles a small, hand-picked team.",
        "Rating": "R",
        "Title": "The Untouchables",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Crime, Mystery, Thriller",
        "MovieID": 385,
        "Plot": "A story between a mole in the police department and an undercover cop. Their objectives are the same: to find out who is the mole, and who is the cop.",
        "Rating": "R",
        "Title": "Infernal Affairs",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Mystery, Sci-Fi",
        "MovieID": 386,
        "Plot": "A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.",
        "Rating": "R",
        "Title": "Prometheus",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Drama, Thriller",
        "MovieID": 387,
        "Plot": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.",
        "Rating": "R",
        "Title": "The Lives of Others",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 388,
        "Plot": "A young American studying in Paris in 1968 strikes up a friendship with a French brother and sister. Set against the background of the '68 Paris student riots.",
        "Rating": "NC-17",
        "Title": "The Dreamers",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama, Fantasy, Romance",
        "MovieID": 389,
        "Plot": "An uncommonly gentle young man, who happens to have scissors for hands, falls in love with a beautiful adolescent girl.",
        "Rating": "PG-13",
        "Title": "Edward Scissorhands",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Action, Fantasy",
        "MovieID": 390,
        "Plot": "Nick Fury of S.H.I.E.L.D. assembles a team of superheroes to save the planet from Loki and his army.",
        "Rating": "PG-13",
        "Title": "The Avengers",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sci-Fi",
        "MovieID": 391,
        "Plot": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.",
        "Rating": "Not Rated",
        "Title": "Metropolis",
        "Year": "1927"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Thriller",
        "MovieID": 392,
        "Plot": "A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.",
        "Rating": "R",
        "Title": "The Silence of the Lambs",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 393,
        "Plot": "A man and his son search for a stolen bicycle vital for his job.",
        "Rating": "Not Rated",
        "Title": "Bicycle Thieves",
        "Year": "1948"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 394,
        "Plot": "A pair of losers try to pretend that their murdered employer is really alive, but the murderer is out to \"finish him off.\"",
        "Rating": "PG-13",
        "Title": "Weekend at Bernie's",
        "Year": "1989"
    },
    {
        "Copies": "",
        "Genre": "Drama, Film-Noir, Romance",
        "MovieID": 395,
        "Plot": "A woman is asked to spy on a group of Nazi friends in South America. How far will she have to go to ingratiate herself with them?",
        "Rating": "Approved",
        "Title": "Notorious",
        "Year": "1946"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 396,
        "Plot": "In 1960 New York City - the high-powered and glamorous \"Golden Age\" of advertising - Don Draper, the biggest ad man in the business, struggles to stay a step ahead of the rapidly changing ...",
        "Rating": "TV-14",
        "Title": "Smoke Gets in Your Eyes",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 397,
        "Plot": "Intensely touching story of a misunderstood young adolescent who left without attention, delves into a life of petty crime.",
        "Rating": "Not Rated",
        "Title": "The 400 Blows",
        "Year": "1959"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 398,
        "Plot": "N/A",
        "Rating": "N/A",
        "Title": "Star Wars",
        "Year": "1983"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, War",
        "MovieID": 399,
        "Plot": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
        "Rating": "R",
        "Title": "Inglourious Basterds",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 400,
        "Plot": "At South Beach University, a beautiful sorority president takes in a group of unconventional freshman girls seeking acceptance into her house.",
        "Rating": "R",
        "Title": "Pledge This!",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 401,
        "Plot": "Set during the grand, sweeping Napoleonic age, an officer in the French army insults another officer and sets off a life-long enmity. The two officers, D'Hubert and Feraud, cross swords ...",
        "Rating": "PG",
        "Title": "The Duellists",
        "Year": "1977"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 402,
        "Plot": "A young Air Force lieutenant falls in love with fighter planes while his father, a Congressman and war hero, yearns for him to fly heavy bombers.",
        "Rating": "N/A",
        "Title": "The Starfighters",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 403,
        "Plot": "The Fat Slags from Viz hit the big time and become celebrities.",
        "Rating": "N/A",
        "Title": "Fat Slags",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Family, Fantasy",
        "MovieID": 404,
        "Plot": "The first half of this film, set hundreds of years ago, shows how the old man who eventually became Santa Claus was given immortality and chosen to deliver toys to all the children of the world. The second half moves into the modern era, in which Patch, the head elf, strikes out on his own and falls in with an evil toy manufacturer who wants to corner the market and eliminate Santa Claus.",
        "Rating": "PG",
        "Title": "Santa Claus",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Crime",
        "MovieID": 405,
        "Plot": "James Bond is living on the edge to stop an evil arms dealer from starting another world war. Bond crosses all seven continents in order to stop the evil Whitaker and General Koskov.",
        "Rating": "PG",
        "Title": "The Living Daylights",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Sci-Fi, Thriller",
        "MovieID": 406,
        "Plot": "In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.",
        "Rating": "R",
        "Title": "Twelve Monkeys",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Horror, Drama, Mystery",
        "MovieID": 407,
        "Plot": "Professor and students camp out to find Bigfoot-type creature.",
        "Rating": "PG",
        "Title": "Boggy Creek II: And the Legend Continues",
        "Year": "1985"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Biography, Drama",
        "MovieID": 408,
        "Plot": "A mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.",
        "Rating": "R",
        "Title": "127 Hours",
        "Year": "2010"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 409,
        "Plot": "Captives of the very relationships that define and sustain them, nine women resiliently meet the travails and disappointments of life.",
        "Rating": "R",
        "Title": "Nine Lives",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 410,
        "Plot": "The Tramp struggles to help a blind flower girl he has fallen in love with.",
        "Rating": "N/A",
        "Title": "City Lights",
        "Year": "1931"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 411,
        "Plot": "Young man goes to work for gangsters to impress his nightclub-singer girlfriend.",
        "Rating": "Approved",
        "Title": "I Accuse My Parents",
        "Year": "1944"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Sci-Fi",
        "MovieID": 412,
        "Plot": "The Martians kidnap Santa because there is nobody on Mars to give their children presents.",
        "Rating": "Not Rated",
        "Title": "Santa Claus Conquers the Martians",
        "Year": "1964"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime",
        "MovieID": 413,
        "Plot": "A botched card game in London triggers four friends, thugs, weed-growers, hard gangsters, loan sharks and debt collectors to collide with each other in a series of unexpected events, all for the sake of weed, cash and two antique shotguns.",
        "Rating": "R",
        "Title": "Lock, Stock and Two Smoking Barrels",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 414,
        "Plot": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
        "Rating": "PG-13",
        "Title": "The Lord of the Rings: The Two Towers",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Comedy",
        "MovieID": 415,
        "Plot": "Nasik-based Heerendra Dhaan and Raj Ranade are bodyguards of a politician, but after their employer is implicated in a scam, they end up assaulting a police officer and flee to Mumbai. Once...",
        "Rating": "N/A",
        "Title": "Ram Gopal Varma's Indian Flames",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 416,
        "Plot": "The planet from Alien (1979) has been colonized, but contact is lost. This time, the rescue team has impressive firepower, but will it be enough?",
        "Rating": "R",
        "Title": "Aliens",
        "Year": "1986"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Sport",
        "MovieID": 417,
        "Plot": "Having recently been uprooted to Milan, Rocco and his four brothers each look for a new way in life when a prostitute comes between Rocco and his brother Simone.",
        "Rating": "Approved",
        "Title": "Rocco and His Brothers",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, War",
        "MovieID": 418,
        "Plot": "Three WWII veterans return home to small-town America to discover that they and their families have been irreparably changed.",
        "Rating": "N/A",
        "Title": "The Best Years of Our Lives",
        "Year": "1946"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 419,
        "Plot": "In 1962, the United States government enlists the help of Mutants with superhuman abilities to stop a malicious dictator who is determined to start world war III.",
        "Rating": "PG-13",
        "Title": "X-Men: First Class",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Biography",
        "MovieID": 420,
        "Plot": "The slave Spartacus leads a violent revolt against the decadent Roman Republic.",
        "Rating": "PG-13",
        "Title": "Spartacus",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 421,
        "Plot": "A woman seeks revenge on her former lover, who owns a skydiving business.",
        "Rating": "N/A",
        "Title": "The Skydivers",
        "Year": "1963"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Thriller",
        "MovieID": 422,
        "Plot": "Eight years on, a new evil rises from where the Batman and Commissioner Gordon tried to bury it, causing the Batman to resurface and fight to protect Gotham City... the very city which brands him an enemy.",
        "Rating": "PG-13",
        "Title": "The Dark Knight Rises",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Drama, Horror, Mystery",
        "MovieID": 423,
        "Plot": "A woman who lives in a darkened old house with her two photosensitive children becomes convinced that her family home is haunted.",
        "Rating": "PG-13",
        "Title": "The Others",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Animation, Drama, War",
        "MovieID": 424,
        "Plot": "A tragic film covering a young boy and his little sister's struggle to survive in Japan during World War II.",
        "Rating": "Unrated",
        "Title": "Grave of the Fireflies",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 425,
        "Plot": "John flies over to Paris to find out his girlfriend Elizabeth. He finds a mysterious fashion designer named Lea and her assistant Claire, and it turns out that Lea was Elizabeth's friend in...",
        "Rating": "R",
        "Title": "Another Nine & a Half Weeks",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Family, Comedy",
        "MovieID": 426,
        "Plot": "An evil millionaire (Hulk Hogan) gets amnesia and then belives that he is Santa Claus.",
        "Rating": "PG",
        "Title": "Santa with Muscles",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Horror, Sci-Fi",
        "MovieID": 427,
        "Plot": "A defecting Soviet scientist is hit by a nuclear explosion near Yucca Flats and roams around as a beast.",
        "Rating": "Unrated",
        "Title": "The Beast of Yucca Flats",
        "Year": "1961"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, War",
        "MovieID": 428,
        "Plot": "A photographer is trapped in Cambodia during tyrant Pol Pot's bloody \"Year Zero\" cleansing campaign, which claimed the lives of two million \"undesirable\" civilians.",
        "Rating": "R",
        "Title": "The Killing Fields",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama, Romance",
        "MovieID": 429,
        "Plot": "Lt. John Dunbar, exiled to a remote western Civil War outpost, befriends wolves and Indians, making him an intolerable aberration in the military.",
        "Rating": "PG-13",
        "Title": "Dances with Wolves",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Crime",
        "MovieID": 430,
        "Plot": "After training with his mentor, Batman begins his war on crime to free the crime-ridden Gotham City from corruption that the Scarecrow and the League of Shadows have cast upon it.",
        "Rating": "PG-13",
        "Title": "Batman Begins",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 431,
        "Plot": "The adventures of the Lafayette Escadrille, young Americans who volunteered for the French military before the U.S. entered World War I, and became the country's first fighter pilots.",
        "Rating": "PG-13",
        "Title": "Flyboys",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Drama, Thriller",
        "MovieID": 432,
        "Plot": "A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life's harsh realities, all in the name of love.",
        "Rating": "R",
        "Title": "Amores Perros",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 433,
        "Plot": "The Tramp struggles to live in modern industrial society with the help of a young homeless woman.",
        "Rating": "G",
        "Title": "Modern Times",
        "Year": "1936"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Music",
        "MovieID": 434,
        "Plot": "The incredible story of Wolfgang Amadeus Mozart, told by his peer and secret rival Antonio Salieri - now confined to an insane asylum.",
        "Rating": "R",
        "Title": "Amadeus",
        "Year": "1984"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Romance",
        "MovieID": 435,
        "Plot": "A young car thief kills a policeman and tries to persuade a girl to hide in Italy with him.",
        "Rating": "Unrated",
        "Title": "Breathless",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy",
        "MovieID": 436,
        "Plot": "When a small town police station is threatened with shutting down because of too little crime, the police realise that something has to be done...",
        "Rating": "N/A",
        "Title": "Kopps",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, Fantasy",
        "MovieID": 437,
        "Plot": "Theseus is a mortal man chosen by Zeus to lead the fight against the ruthless King Hyperion, who is on a rampage across Greece to obtain a weapon that can destroy humanity.",
        "Rating": "R",
        "Title": "Immortals",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Crime",
        "MovieID": 438,
        "Plot": "Detective Sherlock Holmes and his stalwart partner Watson engage in a battle of wits and brawn with a nemesis whose plot is a threat to all of England.",
        "Rating": "PG-13",
        "Title": "Sherlock Holmes",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 439,
        "Plot": "Three rebellious teenage girls decide to even the score in the battle of the sexes.",
        "Rating": "R",
        "Title": "The Smokers",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 440,
        "Plot": "After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence.",
        "Rating": "Unrated",
        "Title": "Wild Strawberries",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Music",
        "MovieID": 441,
        "Plot": "A girl tries to become the top star in the glamorous world of Go-Go Dancing.",
        "Rating": "R",
        "Title": "Girl in Gold Boots",
        "Year": "1968"
    },
    {
        "Copies": "",
        "Genre": "Horror, Mystery, Thriller",
        "MovieID": 442,
        "Plot": "Five friends go for a break at a remote cabin in the woods, where they get more than they bargained for. Together, they must discover the truth behind the cabin in the woods.",
        "Rating": "R",
        "Title": "The Cabin in the Woods",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Horror, Sci-Fi",
        "MovieID": 443,
        "Plot": "A young security guard must track down diminutive aliens who kill people even as they make their fantasies come true.",
        "Rating": "R",
        "Title": "Hobgoblins",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 444,
        "Plot": "An ancient struggle between two Cybertronian races, the heroic Autobots and the evil Decepticons, comes to Earth, with a clue to the ultimate power held by a teenager.",
        "Rating": "PG-13",
        "Title": "Transformers",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Biography, Crime, Drama",
        "MovieID": 445,
        "Plot": "Henry Hill and his friends work their way up through the mob hierarchy.",
        "Rating": "R",
        "Title": "Goodfellas",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": null,
        "MovieID": 446,
        "Plot": null,
        "Rating": "PG-13",
        "Title": "Les Misérables",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 447,
        "Plot": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\".",
        "Rating": "PG-13",
        "Title": "3 Idiots",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Thriller",
        "MovieID": 448,
        "Plot": "After a simple jewelery heist goes terribly wrong, the surviving criminals begin to suspect that one of them is a police informant.",
        "Rating": "R",
        "Title": "Reservoir Dogs",
        "Year": "1992"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi",
        "MovieID": 449,
        "Plot": "An inventor comes up with a time machine, but must prevent its abuse at the hands of an evil C.E.O.",
        "Rating": "PG-13",
        "Title": "Tangents",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Biography, Comedy, Drama",
        "MovieID": 450,
        "Plot": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caretaker.",
        "Rating": "R",
        "Title": "The Intouchables",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 451,
        "Plot": "John Beckwith and Jeremy Grey, a pair of committed womanizers who sneak into weddings to take advantage of the romantic tinge in the air, find themselves at odds with one another when John meets and falls for Claire Cleary.",
        "Rating": "R",
        "Title": "Wedding Crashers",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Romance",
        "MovieID": 452,
        "Plot": "Fledgling writer Briony Tallis, as a 13-year-old, irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit. Based on the British romance novel by Ian McEwan.",
        "Rating": "R",
        "Title": "Atonement",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi, Thriller",
        "MovieID": 453,
        "Plot": "A young man blocks out harmful memories of significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life.",
        "Rating": "R",
        "Title": "The Butterfly Effect",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, History",
        "MovieID": 454,
        "Plot": "In Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "Rating": "R",
        "Title": "Schindler's List",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 455,
        "Plot": "A film detailing the final hours and crucifixion of Jesus Christ.",
        "Rating": "R",
        "Title": "The Passion of the Christ",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Drama",
        "MovieID": 456,
        "Plot": "When Batman, Gordon and Harvey Dent launch an assault on the mob, they let the clown out of the box, the Joker, bent on turning Gotham on itself and bringing any heroes down to his level.",
        "Rating": "PG-13",
        "Title": "The Dark Knight",
        "Year": "2008"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 457,
        "Plot": "A young soldier faces profound disillusionment in the soul-destroying horror of World War I.",
        "Rating": "Unrated",
        "Title": "All Quiet on the Western Front",
        "Year": "1930"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Mystery",
        "MovieID": 458,
        "Plot": "A hapless New York advertising executive is mistaken for a government agent by a group of foreign spies, and is pursued across the country while he looks for a way to survive.",
        "Rating": "Not Rated",
        "Title": "North by Northwest",
        "Year": "1959"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 459,
        "Plot": "An African American police detective is asked to investigate a murder in a racially hostile southern town.",
        "Rating": "Approved",
        "Title": "In the Heat of the Night",
        "Year": "1967"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 460,
        "Plot": "When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.",
        "Rating": "R",
        "Title": "The Exorcist",
        "Year": "1973"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 461,
        "Plot": "When two musicians witness a mob hit, they flee the state in an all female band disguised as women, but further complications set in.",
        "Rating": "Not Rated",
        "Title": "Some Like It Hot",
        "Year": "1959"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Fantasy",
        "MovieID": 462,
        "Plot": "Three unknowing martial artists are summoned to a mysterious island to compete in a tournament whose outcome will decide the fate of the world.",
        "Rating": "PG-13",
        "Title": "Mortal Kombat",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 463,
        "Plot": "An ex-prize fighter turned longshoreman struggles to stand up to his corrupt union bosses.",
        "Rating": "Not Rated",
        "Title": "On the Waterfront",
        "Year": "1954"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance, Short",
        "MovieID": 464,
        "Plot": "In a typical school dorm two parties are colliding. One is the Hockey guys and their girls the other the drama students. As the night progresses one of the hockey guys deceides to shoot the...",
        "Rating": "N/A",
        "Title": "Elevhemmet",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Documentary, Music",
        "MovieID": 465,
        "Plot": "From the early black and white days to their colourful hedonistic era, you will Rock! See them at their most creative, and destructive, and experience The Who: Here!",
        "Rating": "PG",
        "Title": "The Kids Are Alright",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Drama",
        "MovieID": 466,
        "Plot": "Two Chicago firefighter brothers who don't get along have to work together while a dangerous arsonist is on the loose.",
        "Rating": "R",
        "Title": "Backdraft",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 467,
        "Plot": "Told in Documentary form, the film depicts a group of five British film critics and politicians who venture off into the West Virginian wilderness in search of the \"Tony Blair Witch\" which ...",
        "Rating": "Unrated",
        "Title": "The Tony Blair Witch Project",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Sci-Fi",
        "MovieID": 468,
        "Plot": "A Gulf war veteran is wrongly sent to a mental institution for insane criminals, where he becomes the object of a Doctor's experiments, and his life is completely affected by them.",
        "Rating": "R",
        "Title": "The Jacket",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 469,
        "Plot": "A spoiled heiress, running away from her family, is helped by a man who's actually a reporter looking for a story.",
        "Rating": "Unrated",
        "Title": "It Happened One Night",
        "Year": "1934"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 470,
        "Plot": "Captain Picard and his crew pursue the Borg back in time to stop them from preventing Earth's first contact with an alien species. They also make sure that Zefram Cochrane makes his famous maiden flight at warp speed.",
        "Rating": "PG-13",
        "Title": "Star Trek: First Contact",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 471,
        "Plot": "A man tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.",
        "Rating": "Approved",
        "Title": "The Apartment",
        "Year": "1960"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 472,
        "Plot": "An eccentric, mystical FBI agent arrives in the small Pacific Northwest town of Twin Peaks to investigate the murder of a young high school girl.",
        "Rating": "Unrated",
        "Title": "Pilot",
        "Year": "1990"
    },
    {
        "Copies": "",
        "Genre": "Horror, Sci-Fi",
        "MovieID": 473,
        "Plot": "A young man is transformed into a hideous \"moon beast\" due to a meteor fragment lodged in his body.",
        "Rating": "PG",
        "Title": "Track of the Moon Beast",
        "Year": "1976"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, War",
        "MovieID": 474,
        "Plot": "A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.",
        "Rating": "R",
        "Title": "The Pianist",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 475,
        "Plot": "The claustrophobic world of a WWII German U-boat; boredom, filth, and sheer terror.",
        "Rating": "R",
        "Title": "Das Boot",
        "Year": "1981"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 476,
        "Plot": "A pragmatic U.S. Marine observes the dehumanizing effects the U.S.-Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
        "Rating": "R",
        "Title": "Full Metal Jacket",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Sci-Fi",
        "MovieID": 477,
        "Plot": "A teenager stumbles upon an alien weapon, which transform him into a grotesque killer.",
        "Rating": "PG",
        "Title": "Laserblast",
        "Year": "1978"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 478,
        "Plot": "Upon admittance to a mental institution, a brash rebel rallies the patients to take on the oppressive head nurse.",
        "Rating": "R",
        "Title": "One Flew Over the Cuckoo's Nest",
        "Year": "1975"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 479,
        "Plot": "An elderly woman is found dead in her cottage and DCI Barnaby is convinced the death is not down to natural causes.",
        "Rating": "N/A",
        "Title": "The Killings at Badger's Drift",
        "Year": "1997"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Music",
        "MovieID": 480,
        "Plot": "A talented young boy becomes torn between his unexpected love of dance and the disintegration of his family.",
        "Rating": "PG-13",
        "Title": "Billy Elliot",
        "Year": "2000"
    },
    {
        "Copies": "",
        "Genre": "Fantasy, Sci-Fi",
        "MovieID": 481,
        "Plot": "A mad scientist transforms himself into an aquatic killer.",
        "Rating": "PG",
        "Title": "Zaat",
        "Year": "1971"
    },
    {
        "Copies": "",
        "Genre": "Drama, Romance",
        "MovieID": 482,
        "Plot": "At a turning point in his life, a former tennis pro falls for a femme-fatal type who happens to be dating his friend and soon-to-be brother-in-law.",
        "Rating": "R",
        "Title": "Match Point",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Action, Crime, Drama",
        "MovieID": 483,
        "Plot": "A group of professional bank robbers start to feel the heat from police when they unknowingly leave a clue at their latest heist.",
        "Rating": "R",
        "Title": "Heat",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Western",
        "MovieID": 484,
        "Plot": "Epic story of a mysterious stranger with a harmonica who joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad.",
        "Rating": "PG-13",
        "Title": "Once Upon a Time in the West",
        "Year": "1968"
    },
    {
        "Copies": "",
        "Genre": "Action, Biography, Drama",
        "MovieID": 485,
        "Plot": "When his secret bride is executed for assaulting an English soldier who tried to rape her, a commoner begins a revolt and leads Scottish warriors against the cruel English tyrant who rules Scotland with an iron fist.",
        "Rating": "R",
        "Title": "Braveheart",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 486,
        "Plot": "A silent movie star meets a young dancer, but the arrival of talking pictures sends their careers in opposite directions.",
        "Rating": "PG-13",
        "Title": "The Artist",
        "Year": "2011"
    },
    {
        "Copies": "",
        "Genre": "Comedy",
        "MovieID": 487,
        "Plot": "The comedic misadventures of a person of indeterminable gender.",
        "Rating": "PG-13",
        "Title": "It's Pat",
        "Year": "1994"
    },
    {
        "Copies": "",
        "Genre": "Animation, Family, Fantasy",
        "MovieID": 488,
        "Plot": "Belle, whose father is imprisoned by the Beast, offers herself instead and discovers her captor to be an enchanted prince.",
        "Rating": "G",
        "Title": "Beauty and the Beast",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 489,
        "Plot": "A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie.",
        "Rating": "R",
        "Title": "The Hunt",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 490,
        "Plot": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider who takes the youth under his wing.",
        "Rating": "R",
        "Title": "Wall Street",
        "Year": "1987"
    },
    {
        "Copies": "",
        "Genre": "Horror",
        "MovieID": 491,
        "Plot": "Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife. Silent classic based on the story \"Dracula.\"",
        "Rating": "Unrated",
        "Title": "Nosferatu",
        "Year": "1922"
    },
    {
        "Copies": "",
        "Genre": "Action",
        "MovieID": 492,
        "Plot": "When a scientists daughter is kidnapped, American Ninja (David Bradley), attempts to find her, but this time he teams up with a youngster he has trained in the ways of the ninja.",
        "Rating": "PG-13",
        "Title": "American Ninja V",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 493,
        "Plot": "During the U.S.-Viet Nam War, Captain Willard is sent on a dangerous mission into Cambodia to assassinate a renegade colonel who has set himself up as a god among a local tribe.",
        "Rating": "R",
        "Title": "Apocalypse Now",
        "Year": "1979"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Sci-Fi",
        "MovieID": 494,
        "Plot": "An insurance salesman/adjuster discovers his entire life is actually a T.V. show.",
        "Rating": "PG",
        "Title": "The Truman Show",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Sci-Fi",
        "MovieID": 495,
        "Plot": "Jack Hall, paleoclimatologist, must make a daring trek across America to reach his son, trapped in the cross-hairs of a sudden international storm which plunges the planet into a new Ice Age.",
        "Rating": "PG-13",
        "Title": "The Day After Tomorrow",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Thriller",
        "MovieID": 496,
        "Plot": "A wheelchair bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder.",
        "Rating": "Approved",
        "Title": "Rear Window",
        "Year": "1954"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 497,
        "Plot": "A group of 1950s high schoolers come of age in a bleak, isolated, atrophied West Texas town that is slowly dying, both economically and culturally.",
        "Rating": "R",
        "Title": "The Last Picture Show",
        "Year": "1971"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Mystery",
        "MovieID": 498,
        "Plot": "Sam volunteers to go undercover to discover how rationed gasoline is being stolen from a fuel depot, and Andrew becomes a suspect in a murder case.",
        "Rating": "N/A",
        "Title": "Among the Few",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 499,
        "Plot": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.",
        "Rating": "R",
        "Title": "American History X",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Crime, Drama",
        "MovieID": 500,
        "Plot": "A successful DJ manages to rescue a powerful mobster one night. In order to repay him, the mobster gives him the task of protecting his daughter.",
        "Rating": "PG-13",
        "Title": "In the Mix",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi",
        "MovieID": 501,
        "Plot": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.",
        "Rating": "R",
        "Title": "The Matrix",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Animation, Comedy, Drama",
        "MovieID": 502,
        "Plot": "A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York.",
        "Rating": "Not Rated",
        "Title": "Mary and Max",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Mystery, Sci-Fi",
        "MovieID": 503,
        "Plot": "Humanity finds a mysterious, obviously artificial, object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.",
        "Rating": "G",
        "Title": "2001: A Space Odyssey",
        "Year": "1968"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy, Crime",
        "MovieID": 504,
        "Plot": "After being released from jail, Tommy Vercetti left Liberty City for Vice City--a city overrun by the mob. Now, Tommy is out to make the Vice City his home.",
        "Rating": "N/A",
        "Title": "Grand Theft Auto: Vice City",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Thriller",
        "MovieID": 505,
        "Plot": "After being kidnapped and imprisoned for 15 years, Oh Dae-Su is released, only to find that he must find his captor in 5 days.",
        "Rating": "R",
        "Title": "Oldboy",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama, War",
        "MovieID": 506,
        "Plot": "When soldiers in World War I refuse to continue with an impossible attack, their superior officers decide to make an example of them.",
        "Rating": "Approved",
        "Title": "Paths of Glory",
        "Year": "1957"
    },
    {
        "Copies": "",
        "Genre": "Drama, History, Thriller",
        "MovieID": 507,
        "Plot": "A chronicle of the decade-long hunt for al-Qaeda terrorist leader Osama bin Laden after the September 2001 attacks, and his death at the hands of the Navy S.E.A.L. Team 6 in May 2011.",
        "Rating": "R",
        "Title": "Zero Dark Thirty",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Family",
        "MovieID": 508,
        "Plot": "In the middle of her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and monsters; where humans are changed into animals; and a bathhouse for these creatures.",
        "Rating": "PG",
        "Title": "Spirited Away",
        "Year": "2001"
    },
    {
        "Copies": "",
        "Genre": "Mystery, Sci-Fi",
        "MovieID": 509,
        "Plot": "A man struggles with memories of his past, including a wife he cannot remember, in a nightmarish world with no sun and run by beings with telekinetic powers who seek the souls of humans.",
        "Rating": "R",
        "Title": "Dark City",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Musical, Romance",
        "MovieID": 510,
        "Plot": "A waitress from Texas and a college student from Pennsylvania meet during spring break in Fort Lauderdale, Florida and come together through their shared love of singing.",
        "Rating": "PG",
        "Title": "From Justin to Kelly",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama",
        "MovieID": 511,
        "Plot": "Because of his insistence that his companion is an invisible six-foot rabbit, a whimsical middle-aged man is thought by his family to be insane - but the man might be wiser than anyone knows.",
        "Rating": "Not Rated",
        "Title": "Harvey",
        "Year": "1950"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Fantasy",
        "MovieID": 512,
        "Plot": "A weatherman finds himself living the same day over and over again.",
        "Rating": "PG",
        "Title": "Groundhog Day",
        "Year": "1993"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Drama",
        "MovieID": 513,
        "Plot": "The aliens are coming and their goal is to invade and destroy. Fighting superior technology, Man's best weapon is the will to survive.",
        "Rating": "PG-13",
        "Title": "Independence Day",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Sport",
        "MovieID": 514,
        "Plot": "A wacky free-for-all comedy about the riotous rivalry between snobby skiers and knuckle-dragging snowboarders.",
        "Rating": "PG",
        "Title": "Snowboard Academy",
        "Year": "1996"
    },
    {
        "Copies": "",
        "Genre": "Action, Drama, History",
        "MovieID": 515,
        "Plot": "The events of D-Day, told on a grand scale from both the Allied and German points of view.",
        "Rating": "G",
        "Title": "The Longest Day",
        "Year": "1962"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 516,
        "Plot": "Two women troubled with guy-problems swap homes in each other's countries, where they each meet a local guy and fall in love.",
        "Rating": "PG-13",
        "Title": "The Holiday",
        "Year": "2006"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 517,
        "Plot": "A bored and sheltered princess escapes her guardians and falls in love with an American newsman in Rome.",
        "Rating": "Not Rated",
        "Title": "Roman Holiday",
        "Year": "1953"
    },
    {
        "Copies": "",
        "Genre": "Action, Sci-Fi, Thriller",
        "MovieID": 518,
        "Plot": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her teenage son, John, from a more advanced cyborg, made out of liquid metal.",
        "Rating": "R",
        "Title": "Terminator 2: Judgment Day",
        "Year": "1991"
    },
    {
        "Copies": "",
        "Genre": "Drama, Mystery, Romance",
        "MovieID": 519,
        "Plot": "A woman faces deadly consequences for abandoning her loving relationship with her boyfriend to pursue exciting sexual scenarios with a mysterious celebrity mountaineer.",
        "Rating": "R",
        "Title": "Killing Me Softly",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 520,
        "Plot": "A man gets a chance to meet up with his dream girl from highschool, even though his date with her back then was a complete disaster.",
        "Rating": "R",
        "Title": "There's Something About Mary",
        "Year": "1998"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sport",
        "MovieID": 521,
        "Plot": "A determined woman works with a hardened boxing trainer to become a professional.",
        "Rating": "PG-13",
        "Title": "Million Dollar Baby",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Drama, Romance",
        "MovieID": 522,
        "Plot": "Based on Nick Hornby's best-selling novel, About A Boy is the story of a cynical, immature young man who is taught how to act like a grown-up by a little boy",
        "Rating": "PG-13",
        "Title": "About a Boy",
        "Year": "2002"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Fantasy",
        "MovieID": 523,
        "Plot": "A reluctant hobbit, Bilbo Baggins, sets out to the Lonely Mountain with a spirited group of dwarves to reclaim their mountain home - and the gold within it - from the dragon Smaug.",
        "Rating": "PG-13",
        "Title": "The Hobbit: An Unexpected Journey",
        "Year": "2012"
    },
    {
        "Copies": "",
        "Genre": "Animation, Adventure, Comedy",
        "MovieID": 524,
        "Plot": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.",
        "Rating": "G",
        "Title": "Toy Story",
        "Year": "1995"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama",
        "MovieID": 525,
        "Plot": "The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed.",
        "Rating": "PG-13",
        "Title": "The Diving Bell and the Butterfly",
        "Year": "2007"
    },
    {
        "Copies": "",
        "Genre": "Drama, Horror, Mystery",
        "MovieID": 526,
        "Plot": "A young couple move into a new apartment, only to be surrounded by peculiar neighbors and occurrences. When the wife becomes mysteriously pregnant, paranoia over the safety of her unborn child begins controlling her life.",
        "Rating": "R",
        "Title": "Rosemary's Baby",
        "Year": "1968"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Family, Fantasy",
        "MovieID": 527,
        "Plot": "An overworked mother and her daughter do not get along. When they switch bodies, each is forced to adapt to the others life for one freaky Friday.",
        "Rating": "PG",
        "Title": "Freaky Friday",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Drama",
        "MovieID": 528,
        "Plot": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation for his daughter's attractive friend.",
        "Rating": "R",
        "Title": "American Beauty",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Drama",
        "MovieID": 529,
        "Plot": "An adaptation of Homer's great epic, the film follows the assault on Troy by the united Greek forces and chronicles the fates of the men involved.",
        "Rating": "R",
        "Title": "Troy",
        "Year": "2004"
    },
    {
        "Copies": "",
        "Genre": "Action, Adventure, Romance",
        "MovieID": 530,
        "Plot": "A pilot is the only hope to stop the mutiny of a spacecraft by its security crew, who plot to sell the crew of the ship into slavery.",
        "Rating": "R",
        "Title": "Space Mutiny",
        "Year": "1988"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Western",
        "MovieID": 531,
        "Plot": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "Rating": "Approved",
        "Title": "The Good, the Bad and the Ugly",
        "Year": "1966"
    },
    {
        "Copies": "",
        "Genre": "Comedy, Romance",
        "MovieID": 532,
        "Plot": "When Anus Magillicutty's woman stops a would-be assassin, Anus is forced to interrupt his life of guzzling beer and women to dispose of the corpse. What starts as a simple chore quickly ...",
        "Rating": "Not Rated",
        "Title": "Anus Magillicutty",
        "Year": "2003"
    },
    {
        "Copies": "",
        "Genre": "Biography, Drama, Music",
        "MovieID": 533,
        "Plot": "A chronicle of John Lennon's first years, focused mainly in his adolescence and his relationship with his stern aunt Mimi, who raised him, and his absentee mother Julia, who re-entered his life at a crucial moment in his young life.",
        "Rating": "R",
        "Title": "Nowhere Boy",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama, Film-Noir",
        "MovieID": 534,
        "Plot": "An insurance rep lets himself be talked into a murder/insurance fraud scheme that arouses an insurance investigator's suspicions.",
        "Rating": "N/A",
        "Title": "Double Indemnity",
        "Year": "1944"
    },
    {
        "Copies": "",
        "Genre": "Drama, Sport",
        "MovieID": 535,
        "Plot": "Rocky Balboa, a small-time boxer gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed, in a bout in which he strives to go the distance for his self-respect.",
        "Rating": "PG",
        "Title": "Rocky",
        "Year": "1976"
    },
    {
        "Copies": "",
        "Genre": "Crime, Mystery, Thriller",
        "MovieID": 536,
        "Plot": "A film that explores the dark and miserable town, Basin City, and tells the story of three different people, all caught up in violent corruption.",
        "Rating": "R",
        "Title": "Sin City",
        "Year": "2005"
    },
    {
        "Copies": "",
        "Genre": "Adventure, Family, Fantasy",
        "MovieID": 537,
        "Plot": "Dorothy Gale is swept away to a magical land in a tornado and embarks on a quest to see the Wizard who can help her return home.",
        "Rating": "PG",
        "Title": "The Wizard of Oz",
        "Year": "1939"
    },
    {
        "Copies": "",
        "Genre": "Action, Comedy",
        "MovieID": 538,
        "Plot": "Basketball superstar Dennis Rodman stars as a hip Interpol agent attempting to defeat the deadly plans of a crazed arms dealer.",
        "Rating": "PG-13",
        "Title": "Simon Sez",
        "Year": "1999"
    },
    {
        "Copies": "",
        "Genre": "Crime, Drama",
        "MovieID": 539,
        "Plot": "A promising college athlete takes a turn for the worse when he hooks up with old highschool friends during his summer break.",
        "Rating": "R",
        "Title": "The Hillz",
        "Year": "2004"
    },
    {
        "Copies": "2",
        "Genre": "Animation, Adventure, Drama",
        "MovieID": 540,
        "Plot": "By tying thousands of balloons to his home, 78-year-old Carl sets out to fulfill his lifelong dream to see the wilds of South America. Russell, a wilderness explorer 70 years younger, inadvertently becomes a stowaway.",
        "Rating": "PG",
        "Title": "up",
        "Year": "2009"
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 543,
        "Plot": "",
        "Rating": null,
        "Title": "delete 543",
        "Year": ""
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 544,
        "Plot": "",
        "Rating": null,
        "Title": "544",
        "Year": ""
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 545,
        "Plot": "",
        "Rating": null,
        "Title": "",
        "Year": ""
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 546,
        "Plot": "",
        "Rating": null,
        "Title": "",
        "Year": ""
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 547,
        "Plot": "",
        "Rating": null,
        "Title": "",
        "Year": ""
    },
    {
        "Copies": "",
        "Genre": "",
        "MovieID": 548,
        "Plot": "",
        "Rating": null,
        "Title": "",
        "Year": ""
    }
]
